RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/*!
    \file    gd32h77x_78x_nvmc.h
    \brief   definitions for the NVMC

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_NVMC_H
#define GD32H77X_78X_NVMC_H

#include "gd32h77x_78x.h"

#if (defined(GD32H77X_78X_XW))
#define NVM_VER_2_AND_7_5
#elif (defined(GD32H77X_78X_XP))
#define NVM_VER_2_AND_3_5
#elif (defined(GD32H77X_78X_XI))
#define NVM_VER_1_625_AND_0
#endif

/* NVMC definition */
#define NVMC                                            NVMC_BASE                                           /*!< NVMC register base address */

/* CNVM registers definitions */
#define NVMC_CNVM_KEY                                   REG32((NVMC) + 0x00000004U)                         /*!< CNVM unlock key register */
#define NVMC_CNVM_CTL                                   REG32((NVMC) + 0x0000000CU)                         /*!< CNVM control register */
#define NVMC_CNVM_STAT                                  REG32((NVMC) + 0x00000010U)                         /*!< CNVM status register */
#define NVMC_CNVM_ADDR                                  REG32((NVMC) + 0x00000014U)                         /*!< CNVM address register */
#define NVMC_CNVM_CRCRESULT                             REG32((NVMC) + 0x0000005CU)                         /*!< CNVM CRC result register */
#define NVMC_CNVM_REPCS                                 REG32((NVMC) + 0x000000C8U)                         /*!< CNVM repair function control and status register */
#define NVMC_CNVM_ROBBADDR0                             REG32((NVMC) + 0x000000CCU)                         /*!< CNVM read only bad block 0 address that still has the error after repair during self-check */
#define NVMC_CNVM_ROBBADDR1                             REG32((NVMC) + 0x000000D0U)                         /*!< CNVM read only bad block 1 address that still has the error after repair during self-check */
#define NVMC_CNVM_ROBBADDR2                             REG32((NVMC) + 0x000000D4U)                         /*!< CNVM read only bad block 2 address that still has the error after repair during self-check */
#define NVMC_CNVM_ROBBADDR3                             REG32((NVMC) + 0x000000D8U)                         /*!< CNVM read only bad block 3 address that still has the error after repair during self-check */
#define NVMC_CNVM_ROBBADDRX(x)                          REG32((NVMC) + 0x000000CCU + (uint32_t)((x) * 4U))  /*!< CNVM read only bad block 3 address that still has the error after repair during self-check */
#define NVMC_CNVM_AUTOERR2ADDR0                         REG32((NVMC) + 0x000000ECU)                         /*!< The address 0 where 2 bits error occurs when the bus reads CNVM */
#define NVMC_CNVM_AUTOERR2ADDR1                         REG32((NVMC) + 0x000000F0U)                         /*!< The address 1 where 2 bits error occurs when the bus reads CNVM */
#define NVMC_CNVM_AUTOERR2ADDR2                         REG32((NVMC) + 0x000000F4U)                         /*!< The address 2 where 2 bits error occurs when the bus reads CNVM */
#define NVMC_CNVM_AUTOERR2ADDR3                         REG32((NVMC) + 0x000000F8U)                         /*!< The address 3 where 2 bits error occurs when the bus reads CNVM */
#define NVMC_CNVM_AUTOERR2ADDRX(x)                      REG32((NVMC) + 0x000000ECU + (uint32_t)((x) * 4U))  /*!< The address x(x=0,1,2,3) where 2 bits error occurs when the bus reads CNVM */
#define NVMC_CNVM_OTAFAILADDR                           REG32((NVMC) + 0x00000128U)                         /*!< CNVM OTA fail address register */
#define NVMC_CNVM_PFINJ_KEY                             REG32((NVMC) + 0x000001F0U)                         /*!< CNVM program fault inject unlock key register */
#define NVMC_CNVM_PFINJ                                 REG32((NVMC) + 0x000001F4U)                         /*!< CNVM program fault inject register */

/* ecnvm registers definitions */
#define NVMC_ECNVM_KEY                                  REG32((NVMC) + 0x00000150U)                         /*!< NVMC_ECNVM_CTL unlock key register */
#define NVMC_ECNVM_CTL                                  REG32((NVMC) + 0x00000154U)                         /*!< ecnvm control register */
#define NVMC_ECNVM_STAT                                 REG32((NVMC) + 0x00000158U)                         /*!< ecnvm status register */
#define NVMC_ECNVM_ADDR                                 REG32((NVMC) + 0x0000015CU)                         /*!< ecnvm address register */
#define NVMC_ECNVM_ECCADDR                              REG32((NVMC) + 0x00000160U)                         /*!< ecnvm ECC error address register */

/* NVMC registers definitions */
#define NVMC_PERFCTL                                    REG32((NVMC) + 0x00000000U)                         /*!< NVMC performance control register */
#define NVMC_OBKEY                                      REG32((NVMC) + 0x00000008U)                         /*!< NVMC option byte unlock key register */
#define NVMC_OBCTL                                      REG32((NVMC) + 0x00000018U)                         /*!< NVMC option byte control register */
#define NVMC_OBSTAT0_EFT                                REG32((NVMC) + 0x0000001CU)                         /*!< NVMC effective option byte status0 register */
#define NVMC_OBSTAT0_MDF                                REG32((NVMC) + 0x00000020U)                         /*!< NVMC modified option byte status0 register */
#define NVMC_DCRPADDR_EFT                               REG32((NVMC) + 0x00000028U)                         /*!< NVMC effective DCRP address register */
#define NVMC_DCRPADDR_MDF                               REG32((NVMC) + 0x0000002CU)                         /*!< NVMC modified DCRP address register */
#define NVMC_SCRADDR_EFT                                REG32((NVMC) + 0x00000030U)                         /*!< NVMC effective secure address register */
#define NVMC_SCRADDR_MDF                                REG32((NVMC) + 0x00000034U)                         /*!< NVMC modified secure address register */
#define NVMC_WP_CNVM_EFT                                REG32((NVMC) + 0x00000038U)                         /*!< CNVM effective erase/program protection register */
#define NVMC_WP_CNVM_MDF                                REG32((NVMC) + 0x0000003CU)                         /*!< CNVM modified erase/program protection register */
#define NVMC_BTADDR_EFT                                 REG32((NVMC) + 0x00000040U)                         /*!< NVMC effective boot address register */
#define NVMC_BTADDR_MDF                                 REG32((NVMC) + 0x00000044U)                         /*!< NVMC modified boot address register */
#define NVMC_OBSTAT1_EFT                                REG32((NVMC) + 0x00000050U)                         /*!< NVMC effective option byte status1 register */
#define NVMC_OBSTAT1_MDF                                REG32((NVMC) + 0x00000054U)                         /*!< NVMC modified option byte status1 register */
#define NVMC_WP0_ECNVM_EFT                              REG32((NVMC) + 0x00000080U)                         /*!< NVMC ecnvm effective erase/program protection register 0 */
#define NVMC_WP1_ECNVM_EFT                              REG32((NVMC) + 0x00000084U)                         /*!< NVMC ecnvm effective erase/program protection register 1 */
#define NVMC_WP0_ECNVM_MDF                              REG32((NVMC) + 0x00000088U)                         /*!< NVMC ecnvm modified erase/program protection register 0 */
#define NVMC_WP1_ECNVM_MDF                              REG32((NVMC) + 0x0000008CU)                         /*!< NVMC ecnvm modified erase/program protection register 1 */
#define NVMC_OBREPCTL_EFT                               REG32((NVMC) + 0x00000090U)                         /*!< NVMC effective option byte repair control register */
#define NVMC_OBREPCTL_MDF                               REG32((NVMC) + 0x00000094U)                         /*!< NVMC modified option byte repair control register */
#define NVMC_OBREPSTADDR_EFT                            REG32((NVMC) + 0x00000098U)                         /*!< NVMC effective option byte repair start address register */
#define NVMC_OBREPENDADDR_EFT                           REG32((NVMC) + 0x0000009CU)                         /*!< NVMC effective option byte repair end address register */
#define NVMC_OBREPSTADDR_MDF                            REG32((NVMC) + 0x000000A0U)                         /*!< NVMC modified option byte repair start address register */
#define NVMC_OBREPENDADDR_MDF                           REG32((NVMC) + 0x000000A4U)                         /*!< NVMC modified option byte repair end address register */
#define NVMC_OBBBADDRX_EFT(x)                           REG32((NVMC) + 0x000000A8U + (uint32_t)((x) * 4U))  /*!< NVMC effective option byte bad block x(x=0,1,2,3) address register */
#define NVMC_OBBBADDRX_MDF(x)                           REG32((NVMC) + 0x000000B8U + (uint32_t)((x) * 4U))  /*!< NVMC modified option byte bad block x(x=0,1,2,3) address register */
#define NVMC_BLANKADDR                                  REG32((NVMC) + 0x000000FCU)                         /*!< NVMC blank address register  */
#define NVMC_PID0                                       REG32((NVMC) + 0x00000100U)                         /*!< product ID register 0 */
#define NVMC_PID1                                       REG32((NVMC) + 0x00000104U)                         /*!< product ID register 1 */

