RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* OTP registers definitions */
#define NVMC_OTP_CTL                                    REG32((NVMC) + 0x00000200U)                         /*!< OTP control register */
#define NVMC_OTP_STAT                                   REG32((NVMC) + 0x00000204U)                         /*!< OTP status register */
#define NVMC_OTP_USER_CTL0                              REG32((NVMC) + 0x0000020CU)                         /*!< OTP user control 0 register */
#define NVMC_OTP_USER_CTL1                              REG32((NVMC) + 0x00000210U)                         /*!< OTP user control 1 register */
#define NVMC_OTP_USER_CTL2                              REG32((NVMC) + 0x00000214U)                         /*!< OTP user control 2 register */
#define NVMC_OTP_USER_CTL3                              REG32((NVMC) + 0x00000218U)                         /*!< OTP user control 3 register */
#define NVMC_OTP_USER_CTL4                              REG32((NVMC) + 0x0000021CU)                         /*!< OTP user control 4 register */
#define NVMC_OTP_USER_CTL5                              REG32((NVMC) + 0x00000220U)                         /*!< OTP user control 5 register */

/* bits definitions */
/* CNVM bits definitions */
/* NVMC_CNVM_KEY */
#define NVMC_CNVM_KEY_KEY                               BITS(0,31)                                          /*!< NVMC_CNVM_CTL unlock register bits */

/* NVMC_CNVM_CTL */
#define NVMC_CNVM_CTL_REPRESC                           BIT(31)                                             /*!< the result of the repair function clear bit */
#define NVMC_CNVM_CTL_CRCRERRIE                         BIT(28)                                             /*!< CRC read error interrupt enable bit */
#define NVMC_CNVM_CTL_CRCENDCALIE                       BIT(27)                                             /*!< CRC end of calculation interrupt enable bit */
#define NVMC_CNVM_CTL_AUTOECCDERRDETIE                  BIT(26)                                             /*!< CNVM ECC two bit errors detect interrupt enable bit */
#define NVMC_CNVM_CTL_RSERRIE                           BIT(24)                                             /*!< Read secure error interrupt enable bit */
#define NVMC_CNVM_CTL_RPERRIE                           BIT(23)                                             /*!< Read protection error interrupt enable bit */
#define NVMC_CNVM_CTL_OTAFAILCNT                        BITS(19,20)                                         /*!< OTA fail times count */
#define NVMC_CNVM_CTL_PGSERRIE                          BIT(18)                                             /*!< Program sequence error interrupt enable bit */
#define NVMC_CNVM_CTL_WPERRIE                           BIT(17)                                             /*!< Erase / program protection error interrupt enable bit */
#define NVMC_CNVM_CTL_ENDIE                             BIT(16)                                             /*!< End of operation interrupt enable bit */
#define NVMC_CNVM_CTL_CRCSTART                          BIT(15)                                             /*!< crc check for repair area enable bit */
#define NVMC_CNVM_CTL_CNVM_ECC_LK                       BIT(10)                                             /*!< ECC test function lock bit */
#define NVMC_CNVM_CTL_CNVM_ECC_MODE                     BITS(8,9)                                           /*!< CNVM ECC mode configuration bit */
#define NVMC_CNVM_CTL_START                             BIT(7)                                              /*!< send erase command to NVMC */
#define NVMC_CNVM_CTL_CER                               BIT(4)                                              /*!< chip erase command bit */
#define NVMC_CNVM_CTL_MER                               BIT(3)                                              /*!< CNVM mass erase command bit */
#define NVMC_CNVM_CTL_SER                               BIT(2)                                              /*!< CNVM sector erase command bit */
#define NVMC_CNVM_CTL_PG                                BIT(1)                                              /*!< CNVM program command bit */
#define NVMC_CNVM_CTL_LK                                BIT(0)                                              /*!< NVMC_CNVM_CTL lock bit */

/* NVMC_CNVM_STAT */
#define NVMC_CNVM_STAT_CNVMECCF                         BIT(31)                                             /*!< CNVM ECC function flag bit */
#define NVMC_CNVM_STAT_BOOT_AT_CHECK_SYS_EFT            BIT(30)                                             /*!< Flag generated by the option byte EFT, indicating boot from the check_bootLoader */
#define NVMC_CNVM_STAT_BOOT_AT_CHECK_SYS_MDF            BIT(29)                                             /*!< Flag generated by the option byte MDF, indicating boot from the check_bootLoader */
#define NVMC_CNVM_STAT_CRCRERR                          BIT(28)                                             /*!< CRC read error flag bit */
#define NVMC_CNVM_STAT_CRCENDCAL                        BIT(27)                                             /*!< CRC end of calculation flag bit */
#define NVMC_CNVM_STAT_AUTOECCDERRDET                   BIT(26)                                             /*!< Two bit errors detect flag bit */
#define NVMC_CNVM_STAT_RSERR                            BIT(24)                                             /*!< Read secure error flag bit */
#define NVMC_CNVM_STAT_RPERR                            BIT(23)                                             /*!< Read protection error flag bit */
#define NVMC_CNVM_STAT_UPDATESTRERR                     BIT(22)                                             /*!< Update startup failure error flag bit */
#define NVMC_CNVM_STAT_ECNVM_ENDF                       BIT(21)                                             /*!< End of ecnvm operation flag bit */
#define NVMC_CNVM_STAT_OTASUC                           BIT(20)                                             /*!< OTA upgrade, bootloader check success flag bit */
#define NVMC_CNVM_STAT_OTAFAIL                          BIT(19)                                             /*!< OTA upgrade, bootloader check failure flag bit */
#define NVMC_CNVM_STAT_PGSERR                           BIT(18)                                             /*!< Program sequence error flag bit */
#define NVMC_CNVM_STAT_WPERR                            BIT(17)                                             /*!< Erase / program protection error flag bit */
#define NVMC_CNVM_STAT_ENDF                             BIT(16)                                             /*!< End of operation flag bit */
#define NVMC_CNVM_STAT_NVMVER                           BITS(14,15)                                         /*!< NVM version bits */
#define NVMC_CNVM_STAT_CRCBUSY                          BIT(3)                                              /*!< The CNVM CRC is busy bit */
#define NVMC_CNVM_STAT_BUSY                             BIT(0)                                              /*!< The CNVM is busy bit */

