RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* NVMC_CNVM_ADDR */
#define NVMC_CNVM_ADDR_ADDR                             BITS(0,31)                                          /*!< CNVM erase command address bits */

/* NVMC_CNVM_CRCRESULT */
#define NVMC_CNVM_CRCRESULT_CRC_RESULT                  BITS(0,31)                                          /*!< CNVM CRC result bits */

/* NVMC_CNVM_REPCS */
#define NVMC_CNVM_REPCS_BLANKMODE                       BIT(20)                                             /*!< ECNVM data integrity enhancement content blank mode */
#define NVMC_CNVM_REPCS_ROBBCNT                         BITS(16,19)                                         /*!< the number of repair failures during the self-check */
#define NVMC_CNVM_REPCS_REPERRSTAT                      BITS(8,11)                                          /*!< self-check result, error status */
#define NVMC_CNVM_REPCS_ECNVM_BLANKIE                   BIT(6)                                              /*!< the ecnvm data integrity enhancement content blank interrupt was enabled */
#define NVMC_CNVM_REPCS_ECNVM_BLANK                     BIT(5)                                              /*!< ecnvm data integrity enhancement content is blank flag */
#define NVMC_CNVM_REPCS_REPDONEIE                       BIT(3)                                              /*!< self-repair done interrupt enable */
#define NVMC_CNVM_REPCS_REPEND                          BIT(2)                                              /*!< self-repair end flag */
#define NVMC_CNVM_REPCS_REPSTRERR                       BIT(1)                                              /*!< self-check repair configuration error bit */
#define NVMC_CNVM_REPCS_REPSTART                        BIT(0)                                              /*!< repair start bit */

/* NVMC_CNVM_ROBBADDRX */
#define NVMC_CNVM_ROBBADDRX_ROBBADDR                    BITS(5,20)                                          /*!< the address that still has the error after repair during the self-check process */
#define NVMC_CNVM_ROBBADDRX_ROBBADDRSTAT                BITS(0,1)                                           /*!< state of ROBBADDR */

/* NVMC_CNVM_AUTOERR2ADDRX */
#define NVMC_CNVM_AUTOERR2ADDRX_AUTOERR2ADDR            BITS(5,31)                                          /*!< the address where 2 bit error occurs when the bus reads CNVM */
#define NVMC_CNVM_AUTOERR2ADDRX_AUTOERR2ADDRSTAT        BIT(0)                                              /*!< state of AUTOERR2ADDR */

/* NVMC_CNVM_OTAFAILADDR */
#define NVMC_CNVM_OTAFAILADDR_OTAFAILADDR               BITS(0,20)                                          /*!< the 1/2 bit error address that occurs if it is not repaired during the self-check process */

/* NVMC_CNVM_PFINJ_KEY */
#define NVMC_CNVM_PFINJ_KEY_PFINJ_KEY                   BITS(0,31)                                          /*!< NVMC_CNVM_PFINJ unlock register bit */

/* NVMC_CNVM_PFINJ */
#define NVMC_CNVM_PFINJ_CNVM0_PFINJ_DATA                BITS(4,6)                                           /*!< when PFINJEN[1:0] is set to 0x3, CNVM0_PFINJ_DATA[*] is set 1, the corresponding position of CNVM0_DATAIN[*] is reversed */
#define NVMC_CNVM_PFINJ_CNVM1_PFINJ_DATA                BITS(7,9)                                           /*!< when PFINJEN[1:0] is set to 0x3, CNVM1_PFINJ_DATA[*] is set 1, the corresponding position of CNVM1_DATAIN[*] is reversed */
#define NVMC_CNVM_PFINJ_PFINJEN                         BITS(12,13)                                         /*!< program fault inject enable bit */

/* ecnvm bits definitions */
/* NVMC_ECNVM_KEY */
#define NVMC_ECNVM_KEY_KEY                              BITS(0,31)                                          /*!< NVMC_ECNVM_CTL unlock key bits */

/* NVMC_ECNVM_CTL */
#define NVMC_ECNVM_CTL_LK                               BIT(0)                                              /*!< NVMC_ECNVM_CTL lock bit */
#define NVMC_ECNVM_CTL_PG                               BIT(1)                                              /*!< main ecnvm program command bit */
#define NVMC_ECNVM_CTL_SER                              BIT(2)                                              /*!< main ecnvm sector erase command bit */
#define NVMC_ECNVM_CTL_MER                              BIT(3)                                              /*!< main ecnvm mass erase command bit */
#define NVMC_ECNVM_CTL_PGCHEN                           BIT(4)                                              /*!< check programming area enable bit */
#define NVMC_ECNVM_CTL_PER                              BIT(6)                                              /*!< page erase command bit */
#define NVMC_ECNVM_CTL_START                            BIT(7)                                              /*!< send erase command to ecnvm bit */
#define NVMC_ECNVM_CTL_ENDIE                            BIT(16)                                             /*!< end of operation interrupt enable bit */
#define NVMC_ECNVM_CTL_WPERRIE                          BIT(17)                                             /*!< write protection error interrupt enable bit */
#define NVMC_ECNVM_CTL_PGSERRIE                         BIT(18)                                             /*!< program sequence error interrupt enable bit */
#define NVMC_ECNVM_CTL_RPERRIE                          BIT(23)                                             /*!< read protection error interrupt enable bit */
#define NVMC_ECNVM_CTL_RSERRIE                          BIT(24)                                             /*!< read secure error interrupt enable bit */
#define NVMC_ECNVM_CTL_ECCDETIE                         BIT(26)                                             /*!< two bits detect error interrupt enable bit */
#define NVMC_ECNVM_CTL_CHIP_REMOVE_EN                   BIT(31)                                             /*!< protection-removed chip erase enable bit */

/* NVMC_ECNVM_STAT */
#define NVMC_ECNVM_STAT_BUSY                            BIT(0)                                              /*!< ecnvm busy flag bit */
#define NVMC_ECNVM_STAT_ENDF                            BIT(16)                                             /*!< end of operation flag bit */
#define NVMC_ECNVM_STAT_WPERR                           BIT(17)                                             /*!< write protection error flag bit */
#define NVMC_ECNVM_STAT_PGSERR                          BIT(18)                                             /*!< program sequence error flag bit */
#define NVMC_ECNVM_STAT_RPERR                           BIT(23)                                             /*!< read protection error flag bit */
#define NVMC_ECNVM_STAT_RSERR                           BIT(24)                                             /*!< read secure error flag bit */
#define NVMC_ECNVM_STAT_ECCDET                          BIT(26)                                             /*!< two bits detect error flag bit */
#define NVMC_ECNVM_STAT_ECNVM_ECCF                      BIT(31)                                             /*!< ecnvm ECC function flag */

/* NVMC_ECNVM_ADDR */
#define NVMC_ECNVM_ADDR_ADDR                            BITS(0,31)                                          /*!< ecnvm erase command address bits */

/* NVMC_ECNVM_ECCADDR */
#define NVMC_ECNVM_ECCADDR_ECCADDR                      BITS(0,31)                                          /*!< address of byte where an ECC error is detected */

/* NVMC bits definitions */
/* NVMC_PERFCTL */
#define NVMC_PERFCTL_EMPTY_CNVM_BUF                     BIT(31)                                             /*!< empty CNVM buffer (general buffer and CPU buffer) function */
#define NVMC_PERFCTL_CNVM_BUF_MODE                      BIT(24)                                             /*!< CNVM buffer mode */
#define NVMC_PERFCTL_ECNVM_BUF_PFETCH                   BITS(22,23)                                         /*!< ecnvm buffer prefetch control */
#define NVMC_PERFCTL_ECNVM_PG_SZ                        BITS(20,21)                                         /*!< ecnvm program size */
#define NVMC_PERFCTL_CNVM_GP_BUFSZ                      BITS(18,19)                                         /*!< CNVM general buffer size (for other masters) */
#define NVMC_PERFCTL_CNVM_CPU_BUFSZ                     BITS(16,17)                                         /*!< CNVM cpu buffer size, the buffer size takes effect after a reset */
#define NVMC_PERFCTL_DTREN                              BIT(15)                                             /*!< ecnvm DTR mode enable bit */
#define NVMC_PERFCTL_WSCNT                              BITS(0,3)                                           /*!< wait state counter register */

/* NVMC_OBKEY */
#define NVMC_OBKEY_OBKEY                                BITS(0,31)                                          /*!< option byte unlock key bits */

/* NVMC_OBCTL */
#define NVMC_OBCTL_OBLK                                 BIT(0)                                              /*!< NVMC_OBCTL lock bit */
#define NVMC_OBCTL_OBSTART                              BIT(1)                                              /*!< send option byte change command to ecnvm */
#define NVMC_OBCTL_OBMERRIE                             BIT(30)                                             /*!< option byte modified error interrupt enable bit */
#define NVMC_OBCTL_OBMERR                               BIT(31)                                             /*!< option byte modified error flag */

/* NVMC_OBSTAT0_EFT */
#define NVMC_OBSTAT0_EFT_DISLFI                         BIT(0)                                              /*!< effective option byte Licensed firmware install (LFI) disable bit */
#define NVMC_OBSTAT0_EFT_NOPRINT                        BIT(1)                                              /*!< effective option byte no information is printed during secure boot */
#define NVMC_OBSTAT0_EFT_BOR_TH                         BITS(2,3)                                           /*!< effective option byte brownout reset threshold value */
#define NVMC_OBSTAT0_EFT_NWDG_HW                        BIT(4)                                              /*!< effective option byte watchdog value */
#define NVMC_OBSTAT0_EFT_VFALL                          BIT(5)                                              /*!< effective option byte Firmware image verification enable bit */
#define NVMC_OBSTAT0_EFT_NRST_DPSLP                     BIT(6)                                              /*!< effective option byte deepsleep reset value */
#define NVMC_OBSTAT0_EFT_NRST_STDBY                     BIT(7)                                              /*!< effective option byte standby reset value */
#define NVMC_OBSTAT0_EFT_SPC                            BITS(8,15)                                          /*!< effective option byte security protection code */
#define NVMC_OBSTAT0_EFT_OTA_CHECK                      BIT(16)                                             /*!< effective option byte OTA check status bit */
#define NVMC_OBSTAT0_EFT_FWDGSPD_DPSLP                  BIT(17)                                             /*!< effective option byte watchdog suspend status in deepsleep mode */
#define NVMC_OBSTAT0_EFT_FWDGSPD_STDBY                  BIT(18)                                             /*!< effective option byte watchdog suspend status in standby mode */
#define NVMC_OBSTAT0_EFT_FW_UPDATE                      BIT(19)                                             /*!< effective option byte Firmware update status bit */
#define NVMC_OBSTAT0_EFT_SWAP                           BIT(20)                                             /*!< effective option byte SWAP status bit */
#define NVMC_OBSTAT0_EFT_SCR                            BIT(21)                                             /*!< effective option byte security access mode status bit */
#define NVMC_OBSTAT0_EFT_ITCMECCEN                      BIT(22)                                             /*!< effective option byte ITCM ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_DTCM0ECCEN                     BIT(23)                                             /*!< effective option byte DTCM0 ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_DTCM1ECCEN                     BIT(24)                                             /*!< effective option byte DTCM1 ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_R2_SRAM_ECCEN                  BIT(25)                                             /*!< effective option byte Region 2 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_R1_SRAM_ECCEN                  BIT(26)                                             /*!< effective option byte Region 1 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_R0_SRAM_ECCEN                  BIT(27)                                             /*!< effective option byte Region 0 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_CNVM_ECC_OVRD                  BIT(28)                                             /*!< effective option byte CNVM ECC override enable status bit */
#define NVMC_OBSTAT0_EFT_IOSPDOPEN                      BIT(29)                                             /*!< effective option byte I/O speed optimization, high-speed at low-voltage enable status bit */
#define NVMC_OBSTAT0_EFT_NOPIPE_MODE                    BIT(30)                                             /*!< effective option byte pipeline mode bit */
#define NVMC_OBSTAT0_EFT_VFIMG                          BIT(31)                                             /*!< effective option byte Firmware image verification enable bit */

