RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* NVMC_WP1_ECNVM_MDF */
#define NVMC_WP1_ECNVM_MDF_WP                           BITS(0,27)                                          /*!< modified option byte ECNVM sector erase / program protection option status bit */
#endif /* NVM_VER_XX */

/* NVMC_OBREPCTL_EFT */
#define NVMC_OBREPCTL_EFT_DIEEN                         BIT(0)                                              /*!< effective option byte The data integrity enhancement mode enable status bit */
#define NVMC_OBREPCTL_EFT_HWREPMOD                      BIT(1)                                              /*!< effective option byte Hardware self-check mode status bit */
#define NVMC_OBREPCTL_EFT_REPUNLK                       BITS(3,4)                                           /*!< effective option byte error repair unlock in self-repair function status bit */
#define NVMC_OBREPCTL_EFT_BBREPLEN                      BIT(5)                                              /*!< effective option byte Bad block address replace status bit */
#define NVMC_OBREPCTL_EFT_DIESZ                         BITS(8,12)                                          /*!< effective option byte Option Byte data integrity enhancement size status bit */
#define NVMC_OBREPCTL_EFT_BBMODE                        BIT(13)                                             /*!< effective option byte Mode of determining whether the repair is successful after the repair bit */
#define NVMC_OBREPCTL_EFT_SYSRSTREPDIS                  BIT(14)                                             /*!< effective option byte The system reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_EFT_PORRSTREPDIS                  BIT(15)                                             /*!< effective option byte The power-on reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_EFT_UPDATESZ                      BITS(26,31)                                         /*!< effective option byte update size during OTA upgrade */

/* NVMC_OBREPCTL_MDF */
#define NVMC_OBREPCTL_MDF_DIEEN                         BIT(0)                                              /*!< modified option byte The data integrity enhancement mode enable status bit */
#define NVMC_OBREPCTL_MDF_HWREPMOD                      BIT(1)                                              /*!< modified option byte Hardware self-check mode status bit */
#define NVMC_OBREPCTL_MDF_REPUNLK                       BITS(3,4)                                           /*!< modified option byte error repair unlock in self-repair function status bit */
#define NVMC_OBREPCTL_MDF_BBREPLEN                      BIT(5)                                              /*!< modified option byte Bad block address replace status bit */
#define NVMC_OBREPCTL_MDF_DIESZ                         BITS(8,12)                                          /*!< modified option byte Option Byte data integrity enhancement size bit */
#define NVMC_OBREPCTL_MDF_BBMODE                        BIT(13)                                             /*!< modified option byte Mode of determining whether the repair is successful after the repair bit */
#define NVMC_OBREPCTL_MDF_SYSRSTREPDIS                  BIT(14)                                             /*!< modified option byte The system reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_MDF_PORRSTREPDIS                  BIT(15)                                             /*!< modified option byte The power-on reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_MDF_UPDATESZ                      BITS(26,31)                                         /*!< modified option byte update size during OTA upgrade */

/* NVMC_OBREPSTADDR_EFT */
#define NVMC_OBREPSTADDR_EFT_STARTADDR                  BITS(5,20)                                          /*!< effective option byte Self-check repair start offset address status bit */

/* NVMC_OBREPENDADDR_EFT */
#define NVMC_OBREPENDADDR_EFT_ENDADDR                   BITS(5,20)                                          /*!< effective option byte Self-check repair end offset address status bit */

/* NVMC_OBREPSTADDR_MDF */
#define NVMC_OBREPSTADDR_MDF_STARTADDR                  BITS(5,20)                                          /*!< modified option byte Self-check repair start offset address status bit */

/* NVMC_OBREPENDADDR_EFT */
#define NVMC_OBREPENDADDR_MDF_ENDADDR                   BITS(5,20)                                          /*!< modified option byte Self-check repair end offset address status bit */

/* NVMC_OBBBADDRX_EFT */
#define NVMC_OBBBADDRX_EFT_OBBBADDRVLD                  BIT(0)                                              /*!< effective option byte The bad block address recorded by the option byte valid status bit */
#define NVMC_OBBBADDRX_EFT_OBBBADDR                     BITS(5,20)                                          /*!< effective option byte Bad block address bit */

/* NVMC_OBBBADDRX_MDF */
#define NVMC_OBBBADDRX_MDF_OBBBADDRVLD                  BIT(0)                                              /*!< modified option byte The bad block address recorded by the option byte valid status bit */
#define NVMC_OBBBADDRX_MDF_OBBBADDR                     BITS(5,20)                                          /*!< modified option byte Bad block address status bit */

/* NVMC_BLANKADDR */
#define NVMC_BLANKADDR_BLANKADDR                        BITS(5,20)                                          /*!< ecnvm data integrity enhancement blank address */

/* NVMC_PID0 */
#define NVMC_PID0_PID                                   BITS(0,31)                                          /*!< product ID 0 */

/* NVMC_PID1 */
#define NVMC_PID1_PID                                   BITS(0,31)                                          /*!< product ID 1 */

/* OTP bits definitions */
/* NVMC_OTP_CTL */
#define NVMC_OTP_CTL_AES_KEY_CRC                        BITS(24,31)                                         /*!< 8-bits CRC calculation result value of AES key bits */
#define NVMC_OTP_CTL_OTP_REPSTART                       BIT(16)                                             /*!< OTP repair start signal */
#define NVMC_OTP_CTL_DP_CRC                             BITS(8,15)                                          /*!< 8-bits CRC calculation result value of debug password data */
#define NVMC_OTP_CTL_ENDIE                              BIT(4)                                              /*!< OTP program/repair end flag interrupt enable */
#define NVMC_OTP_CTL_PGSERRIE                           BIT(3)                                              /*!< OTP program sequence error interrupt enable bit */
#define NVMC_OTP_CTL_MULTI_DATAERRIE                    BIT(2)                                              /*!< OTP Multi-redundant data error interrupt enable bit */
#define NVMC_OTP_CTL_DATAERRIE                          BIT(1)                                              /*!< OTP data error interrupt enable bit */
#define NVMC_OTP_CTL_PGLKERRIE                          BIT(0)                                              /*!< OTP program at lock state error interrupt enable bit */

/* NVMC_OTP_STAT */
#define NVMC_OTP_STAT_PGLKERR_ADDR                      BITS(16,28)                                         /*!< low 13 bits of the logical address corresponding to the PGLKERRF */
#define NVMC_OTP_STAT_BUSY                              BIT(5)                                              /*!< OTP busy flag */
#define NVMC_OTP_STAT_ENDF                              BIT(4)                                              /*!< OTP program/repair end flag */
#define NVMC_OTP_STAT_PGSERR                            BIT(3)                                              /*!< OTP program sequence error flag */
#define NVMC_OTP_STAT_MULTI_DATAERRF                    BIT(2)                                              /*!< OTP Multi-redundant data error flag */
#define NVMC_OTP_STAT_DATAERRF                          BIT(1)                                              /*!< OTP Data error flag */
#define NVMC_OTP_STAT_PGLKERRF                          BIT(0)                                              /*!< OTP Program at lock state error flag */

/* NVMC_OTP_USER_CTL0 */
#define NVMC_OTP_USER_CTL0_DCRP_EFFCTL_LK               BIT(31)                                             /*!< DCRP_EFFCTL lock bit */
#define NVMC_OTP_USER_CTL0_SCR_EFFCTL_LK                BIT(30)                                             /*!< SCR_EFFCTL lock bit */
#define NVMC_OTP_USER_CTL0_SCR_LK                       BIT(29)                                             /*!< SCR lock bit */
#define NVMC_OTP_USER_CTL0_SPC_H_LK                     BIT(28)                                             /*!< SPC_H lock bit */
#define NVMC_OTP_USER_CTL0_SPC_L_LK                     BIT(27)                                             /*!< SPC_L lock bit */
#define NVMC_OTP_USER_CTL0_JTAGNSW_LK                   BIT(26)                                             /*!< JTAGNSW lock bit */
#define NVMC_OTP_USER_CTL0_NDBG_LK                      BITS(24,25)                                         /*!< NDBG lock bit */
#define NVMC_OTP_USER_CTL0_DCRP_EFFCTL                  BIT(23)                                             /*!< DCRP area effective control bit */
#define NVMC_OTP_USER_CTL0_SCR_EFFCTL                   BIT(22)                                             /*!< SCR area effective control bit */
#define NVMC_OTP_USER_CTL0_SCR                          BIT(21)                                             /*!< secure mode enable */
#define NVMC_OTP_USER_CTL0_SPC_H                        BIT(20)                                             /*!< configure security protection to level high */
#define NVMC_OTP_USER_CTL0_SPC_L                        BIT(19)                                             /*!< configure security protection to level low */
#define NVMC_OTP_USER_CTL0_JTAGNSW                      BIT(18)                                             /*!< SW or JTAG debugger select */
#define NVMC_OTP_USER_CTL0_NDBG                         BITS(16,17)                                         /*!< debugging permission setting */
#define NVMC_OTP_USER_CTL0_VFALL_LK                     BIT(10)                                             /*!< VFALL lock bit */
#define NVMC_OTP_USER_CTL0_VFIMG_LK                     BIT(9)                                              /*!< VFIMG lock bit */
#define NVMC_OTP_USER_CTL0_DISLFI_LK                    BIT(8)                                              /*!< DISLFI lock bit */
#define NVMC_OTP_USER_CTL0_VFALL                        BIT(2)                                              /*!< firmware image (Image must contain a certificate) verification enable bit */
#define NVMC_OTP_USER_CTL0_VFIMG                        BIT(1)                                              /*!< firmware image verification enable bit */
#define NVMC_OTP_USER_CTL0_DISLFI                       BIT(0)                                              /*!< licensed firmware install (LFI) disable */

/* NVMC_OTP_USER_CTL1 */
#define NVMC_OTP_USER_CTL1_ECNVM_DIE_DISABLE_LK         BIT(14)                                             /*!< ECNVM_DIE_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_BBREPL_DISABLE_LK            BIT(13)                                             /*!< BBREPL_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_SWAP_DISABLE_LK              BIT(12)                                             /*!< SWAP_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_DIE_MODE_LOCK_LK             BIT(11)                                             /*!< DIE_MODE_LOCK lock bit */
#define NVMC_OTP_USER_CTL1_DIE_EN_LK                    BIT(10)                                             /*!< DIE_EN lock bit */
#define NVMC_OTP_USER_CTL1_REPAIR_DISABLE_LK            BIT(9)                                              /*!< REPAIR_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_UPDATE_DISABLE_LK            BIT(8)                                              /*!< UPDATE_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_ECNVM_DIE_DISABLE            BIT(6)                                              /*!< Disable the ecnvm data integrity enhancement function */
#define NVMC_OTP_USER_CTL1_BBREPL_DISABLE               BIT(5)                                              /*!< Force disable the bad block replacement function */
#define NVMC_OTP_USER_CTL1_SWAP_DISABLE                 BIT(4)                                              /*!< Disable the data integrity enhancement area swap function */
#define NVMC_OTP_USER_CTL1_DIE_MODE_LOCK                BIT(3)                                              /*!< Lock the current data integrity enhancement mode configuration */
#define NVMC_OTP_USER_CTL1_DIE_EN                       BIT(2)                                              /*!< Force enable the data integrity enhancement mode */
#define NVMC_OTP_USER_CTL1_REPAIR_DISABLE               BIT(1)                                              /*!< Disable self-check and repair function */
#define NVMC_OTP_USER_CTL1_UPDATE_DISABLE               BIT(0)                                              /*!< Disable OTA update function */

