RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* NVMC_OTP_USER_CTL2 */
#define NVMC_OTP_USER_CTL2_SCR_AREA_END                 BITS(16,24)                                         /*!< secure user area end address bits */
#define NVMC_OTP_USER_CTL2_CNVM_SCR_EN                  BIT(15)                                             /*!< CNVM region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_ECNVM_BANK0_SCR_EN           BIT(14)                                             /*!< ecnvm bank0 region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_ECNVM_BANK1_SCR_EN           BIT(13)                                             /*!< ecnvm bank1 region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_SCR_AREA_START               BITS(0,8)                                           /*!< secure user area start address bits */

/* NVMC_OTP_USER_CTL3 */
#define NVMC_OTP_USER_CTL3_DCRP_AREA_END                BITS(16,24)                                         /*!< DCRP area end address bits */
#define NVMC_OTP_USER_CTL3_CNVM_DCRP_EN                 BIT(15)                                             /*!< CNVM region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_ECNVM_BANK0_DCRP_EN          BIT(14)                                             /*!< ecnvm bank0 region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_ECNVM_BANK1_DCRP_EN          BIT(13)                                             /*!< ecnvm bank1 region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_DCRP_AREA_START              BITS(0,8)                                           /*!< DCRP area start address bits */

/* NVMC_OTP_USER_CTL4 */
#define NVMC_OTP_USER_CTL4_CNVM_DCRP_ENLK               BIT(12)                                             /*!< CNVM_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_ECNVM_BANK0_DCRP_ENLK        BIT(11)                                             /*!< ECNVM_BANK0_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_ECNVM_BANK1_DCRP_ENLK        BIT(10)                                             /*!< ECNVM_BANK1_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_CNVM_SCR_ENLK                BIT(6)                                              /*!< CNVM_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_ECNVM_BANK0_SCR_ENLK         BIT(5)                                              /*!< ECNVM_BANK0_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_ECNVM_BANK1_SCR_ENLK         BIT(4)                                              /*!< ECNVM_BANK1_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_AES_KEY_ON                   BIT(3)                                              /*!< lock OTP_AES_KEY register and enable AES decrypt function */
#define NVMC_OTP_USER_CTL4_DCRP_AREALK                  BIT(2)                                              /*!< DCRP area address lock bit */
#define NVMC_OTP_USER_CTL4_SCR_AREALK                   BIT(1)                                              /*!< Secure user area address lock bit */
#define NVMC_OTP_USER_CTL4_DPLK                         BIT(0)                                              /*!< DBGPSWD_DATA lock bit */

/* NVMC_OTP_USER_CTL5 */
#define NVMC_OTP_USER_CTL5_DUMMY1_LK                    BITS(24,31)                                         /*!< DUMMY1 lock bit */
#define NVMC_OTP_USER_CTL5_DUMMY1                       BITS(16,23)                                         /*!< reserve space for other operations */
#define NVMC_OTP_USER_CTL5_DUMMY0_LK                    BITS(8,15)                                          /*!< DUMMY0 lock bit */
#define NVMC_OTP_USER_CTL5_DUMMY0                       BITS(0,7)                                           /*!< reserve space for other operations */

/* OTP AXI program NVMC_OTP_USER_CTL0 related parameters */
#define OTP_AXI_PROGRAM_DATA_DCRP_EFFCTL_LK             BIT(15)                                             /*!< DCRP_EFFCTL lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_EFFCTL_LK              BIT(14)                                             /*!< SCR_EFFCTL lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_LK                     BIT(13)                                             /*!< SCR lock bit */
#define OTP_AXI_PROGRAM_DATA_SPC_H_LK                   BIT(12)                                             /*!< SPC_H lock bit */
#define OTP_AXI_PROGRAM_DATA_SPC_L_LK                   BIT(11)                                             /*!< SPC_L lock bit */
#define OTP_AXI_PROGRAM_DATA_JTAGNSW_LK                 BIT(10)                                             /*!< JTAGNSW lock bit */
#define OTP_AXI_PROGRAM_DATA_NDBG_LK                    BITS(8,9)                                           /*!< NDBG lock bit */
#define OTP_AXI_PROGRAM_DATA_DCRP_EFFCTL                BIT(7)                                              /*!< DCRP area effective control bit */
#define OTP_AXI_PROGRAM_DATA_SCR_EFFCTL                 BIT(6)                                              /*!< SCR area effective control bit */
#define OTP_AXI_PROGRAM_DATA_SCR                        BIT(5)                                              /*!< secure mode enable */
#define OTP_AXI_PROGRAM_DATA_SPC_H                      BIT(4)                                              /*!< configure security protection to level high */
#define OTP_AXI_PROGRAM_DATA_SPC_L                      BIT(3)                                              /*!< configure security protection to level low */
#define OTP_AXI_PROGRAM_DATA_JTAGNSW                    BIT(2)                                              /*!< SW or JTAG debugger select */
#define OTP_AXI_PROGRAM_DATA_NDBG                       BITS(0,1)                                           /*!< debugging permission setting */
#define OTP_AXI_PROGRAM_DATA_VFALL_LK                   BIT(10)                                             /*!< VFALL lock bit  */
#define OTP_AXI_PROGRAM_DATA_VFIMG_LK                   BIT(9)                                              /*!< VFIMG lock bit */
#define OTP_AXI_PROGRAM_DATA_DISLFI_LK                  BIT(8)                                              /*!< DISLFI lock bit */
#define OTP_AXI_PROGRAM_DATA_VFALL                      BIT(2)                                              /*!< Firmware image verification enable bit  */
#define OTP_AXI_PROGRAM_DATA_VFIMG                      BIT(1)                                              /*!< firmware image verification enable bit */
#define OTP_AXI_PROGRAM_DATA_DISLFI                     BIT(0)                                              /*!< licensed firmware install (LFI) disable */

/* OTP AXI program NVMC_OTP_USER_CTL1 related parameters */
#define OTP_AXI_PROGRAM_DATA_ECNVM_DIE_DISABLE_LK       BIT(14)                                             /*!< ECNVM_DIE_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_BBREPL_DISABLE_LK          BIT(13)                                             /*!< BBREPL_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_SWAP_DISABLE_LK            BIT(12)                                             /*!< SWAP_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_DIE_MODE_LOCK_LK           BIT(11)                                             /*!< DIE_MODE_LOCK lock bit */
#define OTP_AXI_PROGRAM_DATA_DIE_EN_LK                  BIT(10)                                             /*!< DIE_EN lock bit */
#define OTP_AXI_PROGRAM_DATA_REPAIR_DISABLE_LK          BIT(9)                                              /*!< REPAIR_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_UPDATE_DISABLE_LK          BIT(8)                                              /*!< UPDATE_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_ECNVM_DIE_DISABLE          BIT(6)                                              /*!< Disable the ecnvm data integrity enhancement function */
#define OTP_AXI_PROGRAM_DATA_BBREPL_DISABLE             BIT(5)                                              /*!< Force disable the bad block replacement function */
#define OTP_AXI_PROGRAM_DATA_SWAP_DISABLE               BIT(4)                                              /*!< Disable the data integrity enhancement area swap function */
#define OTP_AXI_PROGRAM_DATA_DIE_MODE_LOCK              BIT(3)                                              /*!< Lock the current data integrity enhancement mode configuration */
#define OTP_AXI_PROGRAM_DATA_DIE_EN                     BIT(2)                                              /*!< Force enable the data integrity enhancement mode */
#define OTP_AXI_PROGRAM_DATA_REPAIR_DISABLE             BIT(1)                                              /*!< Disable self-check and repair function */
#define OTP_AXI_PROGRAM_DATA_UPDATE_DISABLE             BIT(0)                                              /*!< Disable OTA update function */

/* OTP AXI program NVMC_OTP_USER_CTL2 related parameters */
#define OTP_AXI_PROGRAM_DATA_SCR_AREA_END               BITS(0,8)                                           /*!< secure user area end address bits */
#define OTP_AXI_PROGRAM_DATA_CNVM_SCR_EN                BIT(15)                                             /*!< CNVM region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK0_SCR_EN         BIT(14)                                             /*!< ecnvm bank0 region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK1_SCR_EN         BIT(13)                                             /*!< ecnvm bank1 region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_SCR_AREA_START             BITS(0,8)                                           /*!< secure user area start address bits */

/* OTP AXI program NVMC_OTP_USER_CTL3 related parameters */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREA_END              BITS(0,8)                                           /*!< DCRP area end address bits */
#define OTP_AXI_PROGRAM_DATA_CNVM_DCRP_EN               BIT(15)                                             /*!< CNVM region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK0_DCRP_EN        BIT(14)                                             /*!< ecnvm bank0 region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK1_DCRP_EN        BIT(13)                                             /*!< ecnvm bank1 region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREA_START            BITS(0,8)                                           /*!< DCRP area start address bits */

/* OTP AXI program NVMC_OTP_USER_CTL4 related parameters */
#define OTP_AXI_PROGRAM_DATA_CNVM_DCRP_ENLK             BIT(12)                                             /*!< CNVM_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK0_DCRP_ENLK      BIT(11)                                             /*!< ECNVM_BANK0_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK1_DCRP_ENLK      BIT(10)                                             /*!< ECNVM_BANK1_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_CNVM_SCR_ENLK              BIT(6)                                              /*!< CNVM_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK0_SCR_ENLK       BIT(5)                                              /*!< ECNVM_BANK0_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_ECNVM_BANK1_SCR_ENLK       BIT(4)                                              /*!< ECNVM_BANK1_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_AES_KEY_ON                 BIT(3)                                              /*!< lock OTP_AES_KEY register and enable AES decrypt function */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREALK                BIT(2)                                              /*!< DCRP area address lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_AREALK                 BIT(1)                                              /*!< Secure user area address lock bit */
#define OTP_AXI_PROGRAM_DATA_DPLK                       BIT(0)                                              /*!< DBGPSWD_DATA lock bit */

/* NVMC_OTP_USER_CTL5 */
#define OTP_AXI_PROGRAM_DATA_DUMMY1_LK                  BITS(8,15)                                          /*!< DUMMY1 lock bit */
#define OTP_AXI_PROGRAM_DATA_DUMMY1                     BITS(0,7)                                           /*!< reserve space for other operations */
#define OTP_AXI_PROGRAM_DATA_DUMMY0_LK                  BITS(8,15)                                          /*!< DUMMY0 lock bit */
#define OTP_AXI_PROGRAM_DATA_DUMMY0                     BITS(0,7)                                           /*!< reserve space for other operations */

/* unlock key */
#define UNLOCK_KEY0                                     ((uint32_t)0x45670123U)                             /*!< unlock key 0 */
#define UNLOCK_KEY1                                     ((uint32_t)0xCDEF89ABU)                             /*!< unlock key 1 */

#define OB_UNLOCK_KEY0                                  ((uint32_t)0x08192A3BU)                             /*!< option byte unlock key 0 */
#define OB_UNLOCK_KEY1                                  ((uint32_t)0x4C5D6E7FU)                             /*!< option byte unlock key 1 */

