RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
#define PFINJ_UNLOCK_KEY                                ((uint32_t)0xA55A55AAU)                             /*!< CNVM program fault inject unlock key */

/* FMC wait state counter value */
#define PERFCTL_WSCNT(regval)                           (BITS(0,3) & ((uint32_t)(regval) << 0))
#define PERFCTL_WSCNT_1                                 PERFCTL_WSCNT(1)                                    /*!< 1 wait state added */
#define PERFCTL_WSCNT_2                                 PERFCTL_WSCNT(2)                                    /*!< 2 wait state added */
#define PERFCTL_WSCNT_3                                 PERFCTL_WSCNT(3)                                    /*!< 3 wait state added */
#define PERFCTL_WSCNT_4                                 PERFCTL_WSCNT(4)                                    /*!< 4 wait state added */
#define PERFCTL_WSCNT_5                                 PERFCTL_WSCNT(5)                                    /*!< 5 wait state added */
#define PERFCTL_WSCNT_6                                 PERFCTL_WSCNT(6)                                    /*!< 6 wait state added */
#define PERFCTL_WSCNT_7                                 PERFCTL_WSCNT(7)                                    /*!< 7 wait state added */
#define PERFCTL_WSCNT_8                                 PERFCTL_WSCNT(8)                                    /*!< 8 wait state added */
#define PERFCTL_WSCNT_9                                 PERFCTL_WSCNT(9)                                    /*!< 9 wait state added */
#define PERFCTL_WSCNT_10                                PERFCTL_WSCNT(10)                                   /*!< 10 wait state added */
#define PERFCTL_WSCNT_11                                PERFCTL_WSCNT(11)                                   /*!< 11 wait state added */
#define PERFCTL_WSCNT_12                                PERFCTL_WSCNT(12)                                   /*!< 12 wait state added */
#define PERFCTL_WSCNT_13                                PERFCTL_WSCNT(13)                                   /*!< 13 wait state added */
#define PERFCTL_WSCNT_14                                PERFCTL_WSCNT(14)                                   /*!< 14 wait state added */
#define PERFCTL_WSCNT_15                                PERFCTL_WSCNT(15)                                   /*!< 15 wait state added */

/* ECNVM buffer prefetch control */
#define PERFCTL_ECNVM_BUF_PFETCH(regval)                (BITS(22,23) & ((uint32_t)(regval) << 22U))
#define ECNVM_NO_PREFETCH                               PERFCTL_ECNVM_BUF_PFETCH(0)                         /*!< ecnvm no prefetch  */
#define ECNVM_PREFETCH_1_LINE                           PERFCTL_ECNVM_BUF_PFETCH(1)                         /*!< ecnvm prefetch 1 line */
#define ECNVM_PREFETCH_3_LINE                           PERFCTL_ECNVM_BUF_PFETCH(2)                         /*!< ecnvm prefetch 3 line */

/* ECNVM program size */
#define PERFCTL_ECNVM_PG_SZ(regval)                     (BITS(20,21) & ((uint32_t)(regval) << 20U))
#define ECNVM_PROG_SIZE_8BYTES                          PERFCTL_ECNVM_PG_SZ(0)                              /*!< ecnvm program size is 8 bytes */
#define ECNVM_PROG_SIZE_32BYTES                         PERFCTL_ECNVM_PG_SZ(1)                              /*!< ecnvm program size is 32 bytes */

/* CNVM general buffer size value */
#define PERFCTL_CNVM_GP_BUFSZ(regval)                   (BITS(18,19) & ((uint32_t)(regval) << 18U))
#define CNVM_GP_BUF_SIZE1                               PERFCTL_CNVM_GP_BUFSZ(0)                            /*!< CNVM general buffer size is 1x32 bytes */
#define CNVM_GP_BUF_SIZE2                               PERFCTL_CNVM_GP_BUFSZ(1)                            /*!< CNVM general buffer size is 2x32 bytes */
#define CNVM_GP_BUF_SIZE4                               PERFCTL_CNVM_GP_BUFSZ(2)                            /*!< CNVM general buffer size is 4x32 bytes */
#define CNVM_GP_BUF_SIZE8                               PERFCTL_CNVM_GP_BUFSZ(3)                            /*!< CNVM general buffer size is 8x32 bytes */

/* CNVM CPU buffer size value */
#define PERFCTL_CNVM_CPU_BUFSZ(regval)                  (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define CNVM_CPU_BUF_SIZE1                              PERFCTL_CNVM_CPU_BUFSZ(0)                           /*!< CNVM CPU buffer size is 1x32 bytes */
#define CNVM_CPU_BUF_SIZE2                              PERFCTL_CNVM_CPU_BUFSZ(1)                           /*!< CNVM CPU buffer size is 2x32 bytes */
#define CNVM_CPU_BUF_SIZE4                              PERFCTL_CNVM_CPU_BUFSZ(2)                           /*!< CNVM CPU buffer size is 4x32 bytes */
#define CNVM_CPU_BUF_SIZE8                              PERFCTL_CNVM_CPU_BUFSZ(3)                           /*!< CNVM CPU buffer size is 8x32 bytes */

/* ecnvm DTR mode value */
#define PERFCTL_DTREN(regval)                           (BIT(15) & ((uint32_t)(regval) << 15U))
#define ECNVM_DTR_MODE_DISABLE                          PERFCTL_DTREN(0)                                    /*!< Disable ecnvm DTR mode */
#define ECNVM_DTR_MODE_ENABLE                           PERFCTL_DTREN(1)                                    /*!< Enable ecnvm DTR mode */

/* option byte Licensed firmware install configure */
#define OBSTAT0_DISLFI(regval)                          (BIT(0) & ((uint32_t)(regval) << 0U))
#define OB_LICENCE_FW_INSTALL_ENABLE                    OBSTAT0_DISLFI(0)                                   /*!< Enable licensed firmware install */
#define OB_LICENCE_FW_INSTALL_DISABLE                   OBSTAT0_DISLFI(1)                                   /*!< Disable licensed firmware install */

/* option byte information print configure */
#define OBSTAT0_NOPRINT(regval)                         (BIT(1) & ((uint32_t)(regval) << 1U))
#define OB_INFO_PRINT_DISABLE                           OBSTAT0_NOPRINT(0)                                  /*!< Disable information print during secure boot */
#define OB_INFO_PRINT_ENABLE                            OBSTAT0_NOPRINT(1)                                  /*!< Enable information print during secure boot */

/* option byte BOR threshold value */
#define OBSTAT0_BOR_TH(regval)                          (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define OB_BOR_TH_OFF                                   OBSTAT0_BOR_TH(0)                                   /*!< no BOR function */
#define OB_BOR_TH_VALUE1                                OBSTAT0_BOR_TH(1)                                   /*!< BOR threshold value 1 */
#define OB_BOR_TH_VALUE2                                OBSTAT0_BOR_TH(2)                                   /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE3                                OBSTAT0_BOR_TH(3)                                   /*!< BOR threshold value 3 */

