RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* option byte software/hardware free watchdog timer */
#define OBSTAT0_NWDG_HW(regval)                         (BIT(4) & ((uint32_t)(regval) << 4U))
#define OB_FWDGT_HW                                     OBSTAT0_NWDG_HW(0)                                  /*!< hardware free watchdog */
#define OB_FWDGT_SW                                     OBSTAT0_NWDG_HW(1)                                  /*!< software free watchdog */

/* option byte Firmware image (image must contain a certificate) verification */
#define OBSTAT0_VFALL(regval)                           (BIT(5) & ((uint32_t)(regval) << 5U))
#define OB_FW_IMAGE_VERIFICATION_DISABLE                OBSTAT0_VFALL(0)                                    /*!< Disable firmware image verification */
#define OB_FW_IMAGE_VERIFICATION_ENABLE                 OBSTAT0_VFALL(1)                                    /*!< Enable firmware image verification */

/* option byte reset or not entering deep sleep mode */
#define OBSTAT0_NRST_DPSLP(regval)                      (BIT(6) & ((uint32_t)(regval) << 6U))
#define OB_DEEPSLEEP_RST                                OBSTAT0_NRST_DPSLP(0)                               /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST                               OBSTAT0_NRST_DPSLP(1)                               /*!< no reset when entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OBSTAT0_NRST_STDBY(regval)                      (BIT(7) & ((uint32_t)(regval) << 7U))
#define OB_STDBY_RST                                    OBSTAT0_NRST_STDBY(0)                               /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                                   OBSTAT0_NRST_STDBY(1)                               /*!< no reset when entering deepsleep mode */

/* option byte security protection configuration */
#define OBSTAT0_SPC(regval)                             (BITS(8,15) & ((uint32_t)(regval) << 8U))
#define OB_NSPC                                         OBSTAT0_SPC(0xAAU)                                  /*!< no protection */
#define OB_LSPC                                         OBSTAT0_SPC(0xBBU)                                  /*!< protection level low */
#define OB_HSPC                                         OBSTAT0_SPC(0xCCU)                                  /*!< protection level high */

/* option byte OTA check */
#define OBSTAT0_OTA_CHECK(regval)                       (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_OTA_CHECK_DISABLE                            OBSTAT0_OTA_CHECK(0)                                /*!< disable firmware check */
#define OB_OTA_CHECK_ENABLE                             OBSTAT0_OTA_CHECK(1)                                /*!< enable firmware check */

/* option byte FWDG status in deep-sleep mode */
#define OBSTAT0_FWDGSPD_DPSLP(regval)                   (BIT(17) & ((uint32_t)(regval)<< 17U))
#define OB_DPSLP_FWDGT_SUSPEND                          OBSTAT0_FWDGSPD_DPSLP(0)                            /*!< free watchdog is suspended in deep-sleep mode */
#define OB_DPSLP_FWDGT_RUN                              OBSTAT0_FWDGSPD_DPSLP(1)                            /*!< free watchdog is running in deep-sleep mode */

/* option byte FWDG status in standby mode */
#define OBSTAT0_FWDGSPD_STDBY(regval)                   (BIT(18) & ((uint32_t)(regval) << 18U))
#define OB_STDBY_FWDGT_SUSPEND                          OBSTAT0_FWDGSPD_STDBY(0)                            /*!< free watchdog is suspended in standby mode */
#define OB_STDBY_FWDGT_RUN                              OBSTAT0_FWDGSPD_STDBY(1)                            /*!< free watchdog is running in standby mode */

/* option byte firmware update */
#define OBSTAT0_FW_UPDATE(regval)                       (BIT(19) & ((uint32_t)(regval) << 19U))
#define OB_FW_UPDATE_DISABLE                            OBSTAT0_FW_UPDATE(0)                                /*!< disable hardware update data function */
#define OB_FW_UPDATE_ENABLE                             OBSTAT0_FW_UPDATE(1)                                /*!< enable hardware update data function */

/* option byte swap status */
#define OBSTAT0_SWAP(regval)                            (BIT(20) & ((uint32_t)(regval) << 20U))
#define OB_CNVM_BANK0_DATA_INTEGRITY_ENHANCE            OBSTAT0_SWAP(0)                                     /*!< CNVM content is consistent with ecnvm bank0 data integrity enhancement area */
#define OB_CNVM_BANK1_DATA_INTEGRITY_ENHANCE            OBSTAT0_SWAP(1)                                     /*!< CNVM content is consistent with ecnvm bank1 data integrity enhancement area */

/* option byte security access mode configuration */
#define OBSTAT0_SCR(regval)                             (BIT(21) & ((uint32_t)(regval) << 21U))
#define OB_SECURE_MODE_DISABLE                          OBSTAT0_SCR(0)                                      /*!< secure mode disable */
#define OB_SECURE_MODE_ENABLE                           OBSTAT0_SCR(1)                                      /*!< secure mode enable */

#define OBSTAT0_ITCMECCEN(regval)                       (BIT(22) & ((uint32_t)(regval) << 22U))
#define OB_ITCM_ECC_DISABLE                             OBSTAT0_ITCMECCEN(0)                                /*!< disable CPU ITCM ECC function */
#define OB_ITCM_ECC_ENABLE                              OBSTAT0_ITCMECCEN(1)                                /*!< enable CPU ITCM ECC function */

#define OBSTAT0_DTCM0ECCEN(regval)                      (BIT(23) & ((uint32_t)(regval) << 23U))
#define OB_DTCM0_ECC_DISABLE                            OBSTAT0_DTCM0ECCEN(0)                               /*!< disable CPU DTCM0 ECC function */
#define OB_DTCM0_ECC_ENABLE                             OBSTAT0_DTCM0ECCEN(1)                               /*!< enable CPU DTCM0 ECC function */

#define OBSTAT0_DTCM1ECCEN(regval)                      (BIT(24) & ((uint32_t)(regval) << 24U))
#define OB_DTCM1_ECC_DISABLE                            OBSTAT0_DTCM1ECCEN(0)                               /*!< disable CPU DTCM1 ECC function */
#define OB_DTCM1_ECC_ENABLE                             OBSTAT0_DTCM1ECCEN(1)                               /*!< enable CPU DTCM0 ECC function */

#define OBSTAT0_R2_SRAM_ECCEN(regval)                   (BIT(25) & ((uint32_t)(regval) << 25U))
#define OB_R2_SRAM_ECC_DISABLE                          OBSTAT0_R2_SRAM_ECCEN(0)                            /*!< disable Region 2 SRAM ECC function */
#define OB_R2_SRAM_ECC_ENABLE                           OBSTAT0_R2_SRAM_ECCEN(1)                            /*!< enable Region 2 SRAM ECC function */

