RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
#define OBSTAT0_R1_SRAM_ECCEN(regval)                   (BIT(26) & ((uint32_t)(regval) << 26U))
#define OB_R1_SRAM_ECC_DISABLE                          OBSTAT0_R1_SRAM_ECCEN(0)                            /*!< disable Region 1 SRAM ECC function */
#define OB_R1_SRAM_ECC_ENABLE                           OBSTAT0_R1_SRAM_ECCEN(1)                            /*!< enable Region 1 SRAM ECC function */

#define OBSTAT0_R0_SRAM_ECCEN(regval)                   (BIT(27) & ((uint32_t)(regval) << 27U))
#define OB_R0_SRAM_ECC_DISABLE                          OBSTAT0_R0_SRAM_ECCEN(0)                            /*!< disable Region 0 SRAM ECC function */
#define OB_R0_SRAM_ECC_ENABLE                           OBSTAT0_R0_SRAM_ECCEN(1)                            /*!< enable Region 0 SRAM ECC function */

#define OBSTAT0_CNVM_ECC_OVRD(regval)                   (BIT(28) & ((uint32_t)(regval) << 28U))
#define OB_CNVM_ECC_CONTROL_BY_CNVM_ECC_MODE            OBSTAT0_CNVM_ECC_OVRD(0)                            /*!< disable CNVM ECC function */
#define OB_CNVM_ECC_ENABLE                              OBSTAT0_CNVM_ECC_OVRD(1)                            /*!< enable CNVM ECC function */

/* option byte I/O speed optimization configuration */
#define OBSTAT0_IOSPDOPEN(regval)                       (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_IOSPDOPEN_DISABLE                            OBSTAT0_IOSPDOPEN(0)                                /*!< high-speed at low-voltage disable */
#define OB_IOSPDOPEN_ENABLE                             OBSTAT0_IOSPDOPEN(1)                                /*!< high-speed at low-voltage enable */

/* option byte pipe mode configuration */
#define OBSTAT0_NOPIPE_MODE(regval)                     (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_TIMING_FRIENDLY_MODE                         OBSTAT0_NOPIPE_MODE(0)                              /*!< Timing friendly mode */
#define OB_PERFORMANCE_FRIENDLY_MODE                    OBSTAT0_NOPIPE_MODE(1)                              /*!< Performance-first mode */

/* option byte I/O speed optimization configuration */
#define OBSTAT0_VFIMG(regval)                           (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_FIRMWARE_IMG_VERIFY_DISABLE                  OBSTAT0_VFIMG(0)                                    /*!< Disable firmware image verification */
#define OB_FIRMWARE_IMG_VERIFY_ENABLE                   OBSTAT0_VFIMG(1)                                    /*!< Enable firmware image verification */

/* option byte ecnvm bank1 DCRP function enable configuration */
#define OB_DCRPADDR_ECNVM_BANK1_DCRP_EN(regval)         (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_ECNVM_BANK1_DCRP_AREA_DISABLE                OB_DCRPADDR_ECNVM_BANK1_DCRP_EN(0)                  /*!< ecnvm bank1 DCRP function disable */
#define OB_ECNVM_BANK1_DCRP_AREA_ENABLE                 OB_DCRPADDR_ECNVM_BANK1_DCRP_EN(1)                  /*!< ecnvm bank1 DCRP function enable */

/* option byte ecnvm bank0 DCRP function enable configuration */
#define OB_DCRPADDR_ECNVM_BANK0_DCRP_EN(regval)         (BIT(14) & ((uint32_t)(regval) << 14U))
#define OB_ECNVM_BANK0_DCRP_AREA_DISABLE                OB_DCRPADDR_ECNVM_BANK0_DCRP_EN(0)                  /*!< ecnvm bank0 DCRP function disable */
#define OB_ECNVM_BANK0_DCRP_AREA_ENABLE                 OB_DCRPADDR_ECNVM_BANK0_DCRP_EN(1)                  /*!< ecnvm bank0 DCRP function enable */

/* option byte CNVM DCRP function enable configuration */
#define OB_DCRPADDR_CNVM_DCRP_EN(regval)                (BIT(15) & ((uint32_t)(regval) << 15U))
#define OB_CNVM_DCRP_AREA_DISABLE                       OB_DCRPADDR_CNVM_DCRP_EN(0)                         /*!< CNVM region DCRP function disable */
#define OB_CNVM_DCRP_AREA_ENABLE                        OB_DCRPADDR_CNVM_DCRP_EN(1)                         /*!< CNVM region DCRP function enable */

/* option byte ecnvm bank1 DCRP erase enable configuration */
#define OB_DCRPADDR_ECNVM_BANK1_DCRP_EREN(regval)       (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_ECNVM_BANK1_DCRP_AREA_ERASE_DISABLE          OB_DCRPADDR_ECNVM_BANK1_DCRP_EREN(0)                /*!< ecnvm bank1 region DCRP area erase disable */
#define OB_ECNVM_BANK1_DCRP_AREA_ERASE_ENABLE           OB_DCRPADDR_ECNVM_BANK1_DCRP_EREN(1)                /*!< ecnvm bank1 region DCRP area erase enable */

/* option byte ecnvm bank0 DCRP erase enable configuration */
#define OB_DCRPADDR_ECNVM_BANK0_DCRP_EREN(regval)       (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_ECNVM_BANK0_DCRP_AREA_ERASE_DISABLE          OB_DCRPADDR_ECNVM_BANK0_DCRP_EREN(0)                /*!< ecnvm bank0 region DCRP area erase disable */
#define OB_ECNVM_BANK0_DCRP_AREA_ERASE_ENABLE           OB_DCRPADDR_ECNVM_BANK0_DCRP_EREN(1)                /*!< ecnvm bank0 region DCRP area erase enable */

/* option byte CNVM DCRP erase enable configuration */
#define OB_DCRPADDR_CNVM_DCRP_EREN(regval)              (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_CNVM_DCRP_AREA_ERASE_DISABLE                 OB_DCRPADDR_CNVM_DCRP_EREN(0)                       /*!< CNVM region DCRP area erase disable */
#define OB_CNVM_DCRP_AREA_ERASE_ENABLE                  OB_DCRPADDR_CNVM_DCRP_EREN(1)                       /*!< CNVM region DCRP area erase enable */

/* option byte ecnvm bank1 secure function enable configuration */
#define OB_SCRADDR_ECNVM_BANK1_SECURE_EN(regval)        (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_ECNVM_BANK1_SECURE_AREA_DISABLE              OB_SCRADDR_ECNVM_BANK1_SECURE_EN(0)                 /*!< ecnvm bank1 region secure function disable */
#define OB_ECNVM_BANK1_SECURE_AREA_ENABLE               OB_SCRADDR_ECNVM_BANK1_SECURE_EN(1)                 /*!< ecnvm bank1 region secure function enable */

/* option byte ecnvm bank0 secure function enable configuration */
#define OB_SCRADDR_ECNVM_BANK0_SECURE_EN(regval)        (BIT(14) & ((uint32_t)(regval) << 14U))
#define OB_ECNVM_BANK0_SECURE_AREA_DISABLE              OB_SCRADDR_ECNVM_BANK0_SECURE_EN(0)                 /*!< ecnvm bank0 region secure function disable */
#define OB_ECNVM_BANK0_SECURE_AREA_ENABLE               OB_SCRADDR_ECNVM_BANK0_SECURE_EN(1)                 /*!< ecnvm bank0 region secure function enable */

