RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* option byte CNVM secure function enable configuration */
#define OB_SCRADDR_CNVM_SECURE_EN(regval)               (BIT(15) & ((uint32_t)(regval) << 15U))
#define OB_CNVM_SECURE_AREA_DISABLE                     OB_SCRADDR_CNVM_SECURE_EN(0)                        /*!< CNVM region SCR function disable */
#define OB_CNVM_SECURE_AREA_ENABLE                      OB_SCRADDR_CNVM_SECURE_EN(1)                        /*!< CNVM region SCR function enable */

/* option byte ecnvm bank1 secure erase enable configuration */
#define OB_SCRADDR_ECNVM_BANK1_SECURE_EREN(regval)      (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_ECNVM_BANK1_SECURE_AREA_ERASE_DISABLE        OB_SCRADDR_ECNVM_BANK1_SECURE_EREN(0)               /*!< ecnvm bank1 region secure area erase disable */
#define OB_ECNVM_BANK1_SECURE_AREA_ERASE_ENABLE         OB_SCRADDR_ECNVM_BANK1_SECURE_EREN(1)               /*!< ecnvm bank1 region secure area erase enable */

/* option byte ecnvm bank0 secure erase enable configuration */
#define OB_SCRADDR_ECNVM_BANK0_SECURE_EREN(regval)      (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_ECNVM_BANK0_SECURE_AREA_ERASE_DISABLE        OB_SCRADDR_ECNVM_BANK0_SECURE_EREN(0)               /*!< ecnvm bank0 region secure area erase disable */
#define OB_ECNVM_BANK0_SECURE_AREA_ERASE_ENABLE         OB_SCRADDR_ECNVM_BANK0_SECURE_EREN(1)               /*!< ecnvm bank0 region secure area erase enable */

/* option byte ecnvm bank0 secure erase enable configuration */
#define OB_SCRADDR_CNVM_SECURE_EREN(regval)             (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_CNVM_SECURE_AREA_ERASE_DISABLE               OB_SCRADDR_CNVM_SECURE_EREN(0)                      /*!< CNVM region secure area erase disable */
#define OB_CNVM_SECURE_AREA_ERASE_ENABLE                OB_SCRADDR_CNVM_SECURE_EREN(1)                      /*!< CNVM region secure area erase enable */

/* option byte CNVM write protection */
#define OB_CNVM_WP_0                                    ((uint32_t)0x00000001U)                             /*!< CNVM erase/program protection of write protection sector 0~1 */
#define OB_CNVM_WP_1                                    ((uint32_t)0x00000002U)                             /*!< CNVM erase/program protection of write protection sector 2~3 */
#define OB_CNVM_WP_2                                    ((uint32_t)0x00000004U)                             /*!< CNVM erase/program protection of write protection sector 4~5 */
#define OB_CNVM_WP_3                                    ((uint32_t)0x00000008U)                             /*!< CNVM erase/program protection of write protection sector 6~7 */
#define OB_CNVM_WP_4                                    ((uint32_t)0x00000010U)                             /*!< CNVM erase/program protection of write protection sector 8~9 */
#define OB_CNVM_WP_5                                    ((uint32_t)0x00000020U)                             /*!< CNVM erase/program protection of write protection sector 10~11 */
#define OB_CNVM_WP_6                                    ((uint32_t)0x00000040U)                             /*!< CNVM erase/program protection of write protection sector 12~13 */
#define OB_CNVM_WP_7                                    ((uint32_t)0x00000080U)                             /*!< CNVM erase/program protection of write protection sector 14~15 */
#define OB_CNVM_WP_8                                    ((uint32_t)0x00000100U)                             /*!< CNVM erase/program protection of write protection sector 16~17 */
#define OB_CNVM_WP_9                                    ((uint32_t)0x00000200U)                             /*!< CNVM erase/program protection of write protection sector 18~19 */
#define OB_CNVM_WP_10                                   ((uint32_t)0x00000400U)                             /*!< CNVM erase/program protection of write protection sector 20~21 */
#define OB_CNVM_WP_11                                   ((uint32_t)0x00000800U)                             /*!< CNVM erase/program protection of write protection sector 22~23 */
#define OB_CNVM_WP_12                                   ((uint32_t)0x00001000U)                             /*!< CNVM erase/program protection of write protection sector 24~25 */
#define OB_CNVM_WP_13                                   ((uint32_t)0x00002000U)                             /*!< CNVM erase/program protection of write protection sector 26~27 */
#define OB_CNVM_WP_14                                   ((uint32_t)0x00004000U)                             /*!< CNVM erase/program protection of write protection sector 28~29 */
#define OB_CNVM_WP_15                                   ((uint32_t)0x00008000U)                             /*!< CNVM erase/program protection of write protection sector 30~31 */
#define OB_CNVM_WP_ALL                                  ((uint32_t)0x0000FFFFU)                             /*!< CNVM erase/program protection of all sectors */


/* option byte ecnvm write protection */
#define OB_ECNVM_WP_0                                   ((uint64_t)0x0000000000000001U)                     /*!< ecnvm erase/program protection of write protection sector 32~33 */
#define OB_ECNVM_WP_1                                   ((uint64_t)0x0000000000000002U)                     /*!< ecnvm erase/program protection of write protection sector 34~35 */
#define OB_ECNVM_WP_2                                   ((uint64_t)0x0000000000000004U)                     /*!< ecnvm erase/program protection of write protection sector 36~37 */
#define OB_ECNVM_WP_3                                   ((uint64_t)0x0000000000000008U)                     /*!< ecnvm erase/program protection of write protection sector 38~39 */
#define OB_ECNVM_WP_4                                   ((uint64_t)0x0000000000000010U)                     /*!< ecnvm erase/program protection of write protection sector 40~41 */
#define OB_ECNVM_WP_5                                   ((uint64_t)0x0000000000000020U)                     /*!< ecnvm erase/program protection of write protection sector 42~43 */
#define OB_ECNVM_WP_6                                   ((uint64_t)0x0000000000000040U)                     /*!< ecnvm erase/program protection of write protection sector 44~45 */
#define OB_ECNVM_WP_7                                   ((uint64_t)0x0000000000000080U)                     /*!< ecnvm erase/program protection of write protection sector 46~47 */
#define OB_ECNVM_WP_8                                   ((uint64_t)0x0000000000000100U)                     /*!< ecnvm erase/program protection of write protection sector 48~49 */
#define OB_ECNVM_WP_9                                   ((uint64_t)0x0000000000000200U)                     /*!< ecnvm erase/program protection of write protection sector 50~51 */
#define OB_ECNVM_WP_10                                  ((uint64_t)0x0000000000000400U)                     /*!< ecnvm erase/program protection of write protection sector 52~53 */
#define OB_ECNVM_WP_11                                  ((uint64_t)0x0000000000000800U)                     /*!< ecnvm erase/program protection of write protection sector 54~55 */
#define OB_ECNVM_WP_12                                  ((uint64_t)0x0000000000001000U)                     /*!< ecnvm erase/program protection of write protection sector 56~57 */
#define OB_ECNVM_WP_13                                  ((uint64_t)0x0000000000002000U)                     /*!< ecnvm erase/program protection of write protection sector 58~59 */
#define OB_ECNVM_WP_14                                  ((uint64_t)0x0000000000004000U)                     /*!< ecnvm erase/program protection of write protection sector 60~61 */
#define OB_ECNVM_WP_15                                  ((uint64_t)0x0000000000008000U)                     /*!< ecnvm erase/program protection of write protection sector 62~63 */
#define OB_ECNVM_WP_16                                  ((uint64_t)0x0000000000010000U)                     /*!< ecnvm erase/program protection of write protection sector 64~65 */
#define OB_ECNVM_WP_17                                  ((uint64_t)0x0000000000020000U)                     /*!< ecnvm erase/program protection of write protection sector 66~67 */
#define OB_ECNVM_WP_18                                  ((uint64_t)0x0000000000040000U)                     /*!< ecnvm erase/program protection of write protection sector 68~69 */
#define OB_ECNVM_WP_19                                  ((uint64_t)0x0000000000080000U)                     /*!< ecnvm erase/program protection of write protection sector 70~71 */
#define OB_ECNVM_WP_20                                  ((uint64_t)0x0000000000100000U)                     /*!< ecnvm erase/program protection of write protection sector 72~73 */
#define OB_ECNVM_WP_21                                  ((uint64_t)0x0000000000200000U)                     /*!< ecnvm erase/program protection of write protection sector 74~75 */
#define OB_ECNVM_WP_22                                  ((uint64_t)0x0000000000400000U)                     /*!< ecnvm erase/program protection of write protection sector 76~77 */
#define OB_ECNVM_WP_23                                  ((uint64_t)0x0000000000800000U)                     /*!< ecnvm erase/program protection of write protection sector 78~79 */
#define OB_ECNVM_WP_24                                  ((uint64_t)0x0000000001000000U)                     /*!< ecnvm erase/program protection of write protection sector 80~81 */
#define OB_ECNVM_WP_25                                  ((uint64_t)0x0000000002000000U)                     /*!< ecnvm erase/program protection of write protection sector 82~83 */
#define OB_ECNVM_WP_26                                  ((uint64_t)0x0000000004000000U)                     /*!< ecnvm erase/program protection of write protection sector 84~85 */
#define OB_ECNVM_WP_27                                  ((uint64_t)0x0000000008000000U)                     /*!< ecnvm erase/program protection of write protection sector 86~87 */
#define OB_ECNVM_WP_28                                  ((uint64_t)0x0000000010000000U)                     /*!< ecnvm erase/program protection of write protection sector 88~89 */
#define OB_ECNVM_WP_29                                  ((uint64_t)0x0000000020000000U)                     /*!< ecnvm erase/program protection of write protection sector 90~91 */
#define OB_ECNVM_WP_30                                  ((uint64_t)0x0000000040000000U)                     /*!< ecnvm erase/program protection of write protection sector 92~93 */
#define OB_ECNVM_WP_31                                  ((uint64_t)0x0000000080000000U)                     /*!< ecnvm erase/program protection of write protection sector 94~95 */
#define OB_ECNVM_WP_32                                  ((uint64_t)0x0000000100000000U)                     /*!< ecnvm erase/program protection of write protection sector 96~97 */
#define OB_ECNVM_WP_33                                  ((uint64_t)0x0000000200000000U)                     /*!< ecnvm erase/program protection of write protection sector 98~99 */
#define OB_ECNVM_WP_34                                  ((uint64_t)0x0000000400000000U)                     /*!< ecnvm erase/program protection of write protection sector 100~101 */
#define OB_ECNVM_WP_35                                  ((uint64_t)0x0000000800000000U)                     /*!< ecnvm erase/program protection of write protection sector 102~103 */
#define OB_ECNVM_WP_36                                  ((uint64_t)0x0000001000000000U)                     /*!< ecnvm erase/program protection of write protection sector 104~105 */
#define OB_ECNVM_WP_37                                  ((uint64_t)0x0000002000000000U)                     /*!< ecnvm erase/program protection of write protection sector 106~107 */
#define OB_ECNVM_WP_38                                  ((uint64_t)0x0000004000000000U)                     /*!< ecnvm erase/program protection of write protection sector 108~109 */
#define OB_ECNVM_WP_39                                  ((uint64_t)0x0000008000000000U)                     /*!< ecnvm erase/program protection of write protection sector 110~111 */
#define OB_ECNVM_WP_40                                  ((uint64_t)0x0000010000000000U)                     /*!< ecnvm erase/program protection of write protection sector 112~113 */
#define OB_ECNVM_WP_41                                  ((uint64_t)0x0000020000000000U)                     /*!< ecnvm erase/program protection of write protection sector 114~115 */
#define OB_ECNVM_WP_42                                  ((uint64_t)0x0000040000000000U)                     /*!< ecnvm erase/program protection of write protection sector 116~117 */
#define OB_ECNVM_WP_43                                  ((uint64_t)0x0000080000000000U)                     /*!< ecnvm erase/program protection of write protection sector 118~119 */
#define OB_ECNVM_WP_44                                  ((uint64_t)0x0000100000000000U)                     /*!< ecnvm erase/program protection of write protection sector 120~121 */
#define OB_ECNVM_WP_45                                  ((uint64_t)0x0000200000000000U)                     /*!< ecnvm erase/program protection of write protection sector 122~123 */
#define OB_ECNVM_WP_46                                  ((uint64_t)0x0000400000000000U)                     /*!< ecnvm erase/program protection of write protection sector 124~125 */
#define OB_ECNVM_WP_47                                  ((uint64_t)0x0000800000000000U)                     /*!< ecnvm erase/program protection of write protection sector 126~127 */
#define OB_ECNVM_WP_48                                  ((uint64_t)0x0001000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 128~129 */
#define OB_ECNVM_WP_49                                  ((uint64_t)0x0002000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 130~131 */
#define OB_ECNVM_WP_50                                  ((uint64_t)0x0004000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 132~133 */
#define OB_ECNVM_WP_51                                  ((uint64_t)0x0008000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 134~135 */
#define OB_ECNVM_WP_52                                  ((uint64_t)0x0010000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 136~137 */
#define OB_ECNVM_WP_53                                  ((uint64_t)0x0020000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 138~139 */
#define OB_ECNVM_WP_54                                  ((uint64_t)0x0040000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 140~141 */
#define OB_ECNVM_WP_55                                  ((uint64_t)0x0080000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 142~143 */
#define OB_ECNVM_WP_56                                  ((uint64_t)0x0100000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 144~145 */
#define OB_ECNVM_WP_57                                  ((uint64_t)0x0200000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 146~147 */
#define OB_ECNVM_WP_58                                  ((uint64_t)0x0400000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 148~149 */
#define OB_ECNVM_WP_59                                  ((uint64_t)0x0800000000000000U)                     /*!< ecnvm erase/program protection of write protection sector 150~151 */
#define OB_ECNVM_WP_ALL                                 ((uint64_t)0x0FFFFFFFFFFFFFFFU)                     /*!< ecnvm erase/program protection of all sectors */


/* option byte The power-on reset self-check repair function enable status bit */
#define OBREPCTL_PORRSTREPDIS(regval)                   (BIT(15) & ((uint32_t)(regval) << 15U))
#define POR_RESET_REPAIR_DISABLE                        OBREPCTL_PORRSTREPDIS(1)                            /*!< disable power-on reset self-check repair function */
#define POR_RESET_REPAIR_ENABLE                         OBREPCTL_PORRSTREPDIS(0)                            /*!< enable power-on reset self-check repair function */

