RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* option byte The system reset self-check repair function enable status bit */
#define OBREPCTL_SYSRSTREPDIS(regval)                   (BIT(14) & ((uint32_t)(regval) << 14U))
#define SYS_RESET_REPAIR_DISABLE                        OBREPCTL_SYSRSTREPDIS(1)                            /*!< disable system reset self-check repair function */
#define SYS_RESET_REPAIR_ENABLE                         OBREPCTL_SYSRSTREPDIS(0)                            /*!< enable system reset self-check repair function */

/* option byte Mode of determining whether the repair is successful after the repair */
#define OBREPCTL_BBMODE(regval)                         (BIT(13) & ((uint32_t)(regval) << 13U))
#define REPAIR_FAIL_FOR_ANY_ERROR                       OBREPCTL_BBMODE(0)                                  /*!< After repair, any error occurs as repair failure */
#define REPAIR_FAIL_FOR_MORE_THAN_ERR1                  OBREPCTL_BBMODE(1)                                  /*!< After repair, errors greater than 1 bit as repair failure */

/* option byte Bad block address replace status bit */
#define OBREPCTL_BBREPLEN(regval)                       (BIT(5) & ((uint32_t)(regval) << 5U))
#define BAD_CNVM_ADDR_REPLACE_DISABLE                   OBREPCTL_BBREPLEN(0)                                /*!< the data in CNVM is not replaced with ecnvm content when CNVM reads the bad block address */
#define BAD_CNVM_ADDR_REPLACE_ENABLE                    OBREPCTL_BBREPLEN(1)                                /*!< the data in CNVM is automatically replaced with ecnvm content when CNVM reads the bad block address */

/* option byte error repair unlock enable status bit */
#define OBREPCTL_REPUNLK(regval)                        (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define REPAIR_UNLOCK_DISABLE                           OBREPCTL_REPUNLK(0)                                 /*!< disable error repair unlock */
#define REPAIR_UNLOCK_ENABLE                            OBREPCTL_REPUNLK(3)                                 /*!< enable error repair unlock */

/* option byte Hardware self-check mode configuration */
#define OBREPCTL_HWREPMOD(regval)                       (BIT(1) & ((uint32_t)(regval) << 1U))
#define OB_HW_SELF_CHECK_DISABLE                        OBREPCTL_HWREPMOD(0)                                /*!< hardware not do self-check mode (no self-check or self-check by bootloader) */
#define OB_HW_SELF_CHECK_ENABLE                         OBREPCTL_HWREPMOD(1)                                /*!< hardware self-check mode */

/* option byte CNVM data integrity enhancement mode configuration */
#define OBREPCTL_DIEEN(regval)                          (BIT(0) & ((uint32_t)(regval) << 0U))
#define OB_DATA_INTEGRITY_ENHANCE_MODE_DISABLE          OBREPCTL_DIEEN(0)                                   /*!< disable data integrity enhancement mode  */
#define OB_DATA_INTEGRITY_ENHANCE_MODE_ENABLE           OBREPCTL_DIEEN(1)                                   /*!< enable data integrity enhancement mode */

/* OBSTAT1 */
/* option byte ITCM and DTCM RAM sharing status bit */
#define OBSTAT1_ITCM_DTCM_SHARED(regval)                (BITS(4,6) & ((uint32_t)(regval) << 4U))
#define OB_ITCM_DTCM_SHARED_ITCM_0KB                    OBSTAT1_ITCM_DTCM_SHARED(0)                         /*!< ITCM DTCM shared RAM ITCM size is 0Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_64KB                   OBSTAT1_ITCM_DTCM_SHARED(1)                         /*!< ITCM DTCM shared RAM ITCM size is 64-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_128KB                  OBSTAT1_ITCM_DTCM_SHARED(2)                         /*!< ITCM DTCM shared RAM ITCM size is 128-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_192KB                  OBSTAT1_ITCM_DTCM_SHARED(3)                         /*!< ITCM DTCM shared RAM ITCM size is 192-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_256KB                  OBSTAT1_ITCM_DTCM_SHARED(4)                         /*!< ITCM DTCM shared RAM ITCM size is 256-Kbyte */

/* option byte ITCM and AXI RAM sharing status bit */
#define OBSTAT1_ITCM_AXI_SHARED(regval)                 (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define OB_ITCM_AXI_SHARED_ITCM_0KB                     OBSTAT1_ITCM_AXI_SHARED(0)                          /*!< ITCM AXI shared RAM ITCM size is 0-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_64KB                    OBSTAT1_ITCM_AXI_SHARED(1)                          /*!< ITCM AXI shared RAM ITCM size is 64-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_128KB                   OBSTAT1_ITCM_AXI_SHARED(2)                          /*!< ITCM AXI shared RAM ITCM size is 128-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_192KB                   OBSTAT1_ITCM_AXI_SHARED(3)                          /*!< ITCM AXI shared RAM ITCM size is 192-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_256KB                   OBSTAT1_ITCM_AXI_SHARED(4)                          /*!< ITCM AXI shared RAM ITCM size is 256-Kbyte */

/* boot pin value definitions */
#define BOOT_PIN_0                                      ((uint32_t)0x00000000U)                             /*!< boot pin value is '0' */
#define BOOT_PIN_1                                      ((uint32_t)0x00000001U)                             /*!< boot pin value is '1' */

/* option byte CPU bus timeout status bit */
#define OBSTAT1_CPUBUSTO(regval)                        (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_DISABLE         OBSTAT1_CPUBUSTO(0)                                 /*!<  CPU bus timeout reset value in SYSCFG_BUSTO is disable*/
#define OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_ENABLE          OBSTAT1_CPUBUSTO(1)                                 /*!<  CPU bus timeout reset value in SYSCFG_BUSTO is enable*/

/* CNVM ECC mode configuration */
#define CNVM_CTL_CNVM_ECC_MODE(regval)                  (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define CNVM_ECC_MODE_ENABLE_ECC_FUNCTION               CNVM_CTL_CNVM_ECC_MODE(0)                           /*!< Enable ECC function */
#define CNVM_ECC_MODE_SKIP_ECC_WITH_REDUNDANT_ROW       CNVM_CTL_CNVM_ECC_MODE(1)                           /*!< The ECC code value is 0 when writing, and the ECC is skipped when reading. Consider CNVM redundant rows */
#define CNVM_ECC_MODE_SKIP_ECC                          CNVM_CTL_CNVM_ECC_MODE(2)                           /*!< Only bits corresponding to valid data are written, and ECC is skipped when reading */
#define CNVM_ECC_MODE_SKIP_ECC_WITHOUT_REDUNDANT_ROW    CNVM_CTL_CNVM_ECC_MODE(3)                           /*!< The ECC code value is 0 when writing, and the ECC is skipped when reading. Do not consider CNVM redundant rows */

/* CNVM interrupt enable */
#define CNVM_INT_ENDIE                                  NVMC_CNVM_CTL_ENDIE                                 /*!< CNVM end of operation interrupt enable bit */
#define CNVM_INT_WPERRIE                                NVMC_CNVM_CTL_WPERRIE                               /*!< CNVM write protection error interrupt enable bit */
#define CNVM_INT_PGSERRIE                               NVMC_CNVM_CTL_PGSERRIE                              /*!< CNVM program sequence error interrupt enable bit */
#define CNVM_INT_RPERRIE                                NVMC_CNVM_CTL_RPERRIE                               /*!< CNVM read protection error interrupt enable bit */
#define CNVM_INT_RSERRIE                                NVMC_CNVM_CTL_RSERRIE                               /*!< CNVM read secure error interrupt enable bit */
#define CNVM_INT_AUTOECCDERRDETIE                       NVMC_CNVM_CTL_AUTOECCDERRDETIE                      /*!< CNVM two bits detect error interrupt enable bit */
#define CNVM_INT_CRCCALENDIE                            NVMC_CNVM_CTL_CRCENDCALIE                           /*!< CNVM CRC end of calculation interrupt enable bit */
#define CNVM_INT_CRCRERRIE                              NVMC_CNVM_CTL_CRCRERRIE                             /*!< CNVM CRC read error interrupt enable bit */
#define CNVM_INT_REPAIR_ECNVM_BLANKIE                   NVMC_CNVM_REPCS_ECNVM_BLANKIE                           /*!< CNVM ECNVM data integrity enhancement content is blank interrupt enable bit  */
#define CNVM_INT_REPAIR_DONEIE                          NVMC_CNVM_REPCS_REPDONEIE                           /*!< CNVM self-repair done interrupt enable bit  */

/* CNVM flags */
#define CNVM_FLAG_BUSY                                  NVMC_CNVM_STAT_BUSY                                 /*!< CNVM busy flag */
#define CNVM_FLAG_ENDF                                  NVMC_CNVM_STAT_ENDF                                 /*!< CNVM end of operation flag */
#define CNVM_FLAG_WPERR                                 NVMC_CNVM_STAT_WPERR                                /*!< CNVM write protection error flag */
#define CNVM_FLAG_PGSERR                                NVMC_CNVM_STAT_PGSERR                               /*!< CNVM program sequence error flag */
#define CNVM_FLAG_OTAFAIL                               NVMC_CNVM_STAT_OTAFAIL                              /*!< CNVM OTA update, check_bootloader check failure flag */
#define CNVM_FLAG_OTASUC                                NVMC_CNVM_STAT_OTASUC                               /*!< CNVM OTA update, check_bootloader check success flag */
#define CNVM_FLAG_UPDATESTRERR                          NVMC_CNVM_STAT_UPDATESTRERR                         /*!< CNVM update startup failure error flag */
#define CNVM_FLAG_RPERR                                 NVMC_CNVM_STAT_RPERR                                /*!< CNVM read protection error flag */
#define CNVM_FLAG_RSERR                                 NVMC_CNVM_STAT_RSERR                                /*!< CNVM read secure error flag */
#define CNVM_FLAG_AUTOECCDERRDET                        NVMC_CNVM_STAT_AUTOECCDERRDET                       /*!< CNVM two bits detect error flag */
#define CNVM_FLAG_CRCBUSY                               NVMC_CNVM_STAT_CRCBUSY                              /*!< CNVM crc busy flag */
#define CNVM_FLAG_CRCCALEND                             NVMC_CNVM_STAT_CRCENDCAL                            /*!< CNVM CRC end of calculation flag */
#define CNVM_FLAG_CRCRERR                               NVMC_CNVM_STAT_CRCRERR                              /*!< CNVM CRC read error flag */
#define CNVM_FLAG_REPAIR_ECNVM_BLANK                    NVMC_CNVM_REPCS_ECNVM_BLANK                         /*!< CNVM ECNVM data integrity enhancement content is blank flag */
#define CNVM_FLAG_REPAIR_END                            NVMC_CNVM_REPCS_REPEND                              /*!< CNVM self-repair end flag */
#define CNVM_FLAG_REPAIR_REPSTRERR                      NVMC_CNVM_REPCS_REPSTRERR                           /*!< CNVM self-check repair configuration error flag */

/* CNVM interrupt flags */
#define CNVM_INT_FLAG_ENDF                              ((uint8_t)0x00U)                                    /*!< CNVM end of operation interrupt flag */
#define CNVM_INT_FLAG_WPERR                             ((uint8_t)0x01U)                                    /*!< CNVM write protection error interrupt flag */
#define CNVM_INT_FLAG_PGSERR                            ((uint8_t)0x02U)                                    /*!< CNVM program sequence error interrupt flag */
#define CNVM_INT_FLAG_RPERR                             ((uint8_t)0x03U)                                    /*!< CNVM read protection error interrupt flag */
#define CNVM_INT_FLAG_RSERR                             ((uint8_t)0x04U)                                    /*!< CNVM read secure error interrupt flag */
#define CNVM_INT_FLAG_AUTOECCDERRDET                    ((uint8_t)0x06U)                                    /*!< CNVM two bits detect error interrupt flag */
#define CNVM_INT_FLAG_CRCCALEND                         ((uint8_t)0x07U)                                    /*!< CNVM CRC end of calculation interrupt flag */
#define CNVM_INT_FLAG_CRCRERR                           ((uint8_t)0x08U)                                    /*!< CNVM CRC read error interrupt flag */
#define CNVM_INT_FLAG_REPAIR_ECNVM_BLANK                ((uint8_t)0x0BU)                                    /*!< CNVM ECNVM data integrity enhancement content is blank interrupt flag */
#define CNVM_INT_FLAG_REPAIR_END                        ((uint8_t)0x0CU)                                    /*!< CNVM self-repair end interrupt flag */
#define CNVM_INT_FLAG_REPAIR_REPSTRERR                  ((uint8_t)0x0DU)                                    /*!< CNVM self-check repair configuration error interrupt flag */

/* ecnvm interrupt enable */
#define ECNVM_INT_ENDIE                                 NVMC_ECNVM_CTL_ENDIE                                /*!< ecnvm end of operation interrupt enable bit */
#define ECNVM_INT_WPERRIE                               NVMC_ECNVM_CTL_WPERRIE                              /*!< ecnvm write protection error interrupt enable bit */
#define ECNVM_INT_PGSERRIE                              NVMC_ECNVM_CTL_PGSERRIE                             /*!< ecnvm program sequence error interrupt enable bit */
#define ECNVM_INT_RPERRIE                               NVMC_ECNVM_CTL_RPERRIE                              /*!< ecnvm read protection error interrupt enable bit */
#define ECNVM_INT_RSERRIE                               NVMC_ECNVM_CTL_RSERRIE                              /*!< ecnvm read secure error interrupt enable bit */
#define ECNVM_INT_ECCDETIE                              NVMC_ECNVM_CTL_ECCDETIE                             /*!< ecnvm two bits detect error interrupt enable bit */

