RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* ecnvm flags */
#define ECNVM_FLAG_BUSY                                 NVMC_ECNVM_STAT_BUSY                                /*!< ecnvm busy flag */
#define ECNVM_FLAG_ENDF                                 NVMC_ECNVM_STAT_ENDF                                /*!< ecnvm end of operation flag */
#define ECNVM_FLAG_WPERR                                NVMC_ECNVM_STAT_WPERR                               /*!< ecnvm write protection error flag */
#define ECNVM_FLAG_PGSERR                               NVMC_ECNVM_STAT_PGSERR                              /*!< ecnvm program sequence error flag */
#define ECNVM_FLAG_RPERR                                NVMC_ECNVM_STAT_RPERR                               /*!< ecnvm read protection error flag */
#define ECNVM_FLAG_RSERR                                NVMC_ECNVM_STAT_RSERR                               /*!< ecnvm read secure error flag */
#define ECNVM_FLAG_ECCDET                               NVMC_ECNVM_STAT_ECCDET                              /*!< ecnvm two bits detect error flag */

/* ecnvm interrupt flags */
#define ECNVM_INT_FLAG_ENDF                             ((uint8_t)0x00U)                                    /*!< ecnvm end of operation interrupt flag */
#define ECNVM_INT_FLAG_WPERR                            ((uint8_t)0x01U)                                    /*!< ecnvm write protection error interrupt flag */
#define ECNVM_INT_FLAG_PGSERR                           ((uint8_t)0x02U)                                    /*!< ecnvm program sequence error interrupt flag */
#define ECNVM_INT_FLAG_RPERR                            ((uint8_t)0x03U)                                    /*!< ecnvm read protection error interrupt flag */
#define ECNVM_INT_FLAG_RSERR                            ((uint8_t)0x04U)                                    /*!< ecnvm read secure error interrupt flag */
#define ECNVM_INT_FLAG_ECCDET                           ((uint8_t)0x05U)                                    /*!< ecnvm two bits detect error interrupt flag */

/* option byte interrupt enable */
#define NVMC_INT_OBMERRIE                               NVMC_OBCTL_OBMERRIE                                 /*!< option byte modified error interrupt enable bit */

/* option byte flags */
#define NVMC_FLAG_OBMERR                                NVMC_OBCTL_OBMERR                                   /*!< option byte modified error flag */

/* option byte interrupt flags */
#define NVMC_INT_FLAG_OBMERR                            ((uint8_t)0x00U)                                    /*!< option byte modified error interrupt flag */

/* OTP interrupt enable */
#define OTP_INT_ENDIE                                   NVMC_OTP_CTL_ENDIE                                  /*!< OTP program/repair end interrupt enable bit */
#define OTP_INT_DATAERRIE                               NVMC_OTP_CTL_DATAERRIE                              /*!< OTP data error interrupt enable bit */
#define OTP_INT_PGLKERRIE                               NVMC_OTP_CTL_PGLKERRIE                              /*!< OTP program at lock state error interrupt enable bit */
#define OTP_INT_PGSERRIE                                NVMC_OTP_CTL_PGSERRIE                               /*!< OTP program sequence error enable bit */
#define OTP_INT_MULTI_DATAERRIE                         NVMC_OTP_CTL_MULTI_DATAERRIE                        /*!< OTP multi-redundant data error interrupt enable bit */

/* OTP flags */
#define OTP_FLAG_BUSY                                   NVMC_OTP_STAT_BUSY                                  /*!< OTP busy flag */
#define OTP_FLAG_ENDF                                   NVMC_OTP_STAT_ENDF                                  /*!< OTP end of operation flag */
#define OTP_FLAG_DATAERR                                NVMC_OTP_STAT_DATAERRF                              /*!< OTP data error flag */
#define OTP_FLAG_PGLKERR                                NVMC_OTP_STAT_PGLKERRF                              /*!< OTP program at lock state error flag */
#define OTP_FLAG_PGSERR                                 NVMC_OTP_STAT_PGSERR                                /*!< OTP program sequence error flag */
#define OTP_FLAG_MULTI_DATAERR                          NVMC_OTP_STAT_MULTI_DATAERRF                        /*!< OTP multi-redundant data error flag */

/* OTP interrupt flags */
#define OTP_INT_FLAG_ENDF                               ((uint8_t)0x00U)                                    /*!< OTP end of operation interrupt flag */
#define OTP_INT_FLAG_DATAERR                            ((uint8_t)0x01U)                                    /*!< OTP data error interrupt flag */
#define OTP_INT_FLAG_PGLKERR                            ((uint8_t)0x02U)                                    /*!< OTP program at lock state error interrupt flag */
#define OTP_INT_FLAG_PGSERR                             ((uint8_t)0x03U)                                    /*!< OTP program sequence error interrupt flag */
#define OTP_INT_FLAG_MULTI_DATAERR                      ((uint8_t)0x04U)                                    /*!< OTP multi-redundant data error interrupt flag */

/* address and size of NVM */
#define CNVM_BASE_ADDRESS                               ((uint32_t)0x08000000U)                             /*!< CNVM base address */
#define MAIN_ECNVM_BASE_ADDRESS                         ((uint32_t)0x08200000U)                             /*!< main ecnvm base address */
#define OTP_BASE_ADDRESS                                ((uint32_t)0x1FFF0000U)                             /*!< OTP base address */

#if defined(NVM_VER_2_AND_3_5)
/* GD32H77XXP/GD32H78XXP: 3.5MB ecnvm memory and 2MB CNVM */
#define MAIN_ECNVM_DECNVM0_BASE_ADDRESS                 ((uint32_t)0x08200000U)                             /*!< main ecnvm data ecnvm0 base address */
#define MAIN_ECNVM_BANK0_BASE_ADDRESS                   ((uint32_t)0x08300000U)                             /*!< main ecnvm bank0 base address */
#define MAIN_ECNVM_DECNVM1_BASE_ADDRESS                 ((uint32_t)0x08500000U)                             /*!< main ecnvm data ecnvm1 base address */

#define CNVM_SIZE                                       ((uint32_t)0x00200000U)                             /*!< CNVM size */
#define MAIN_ECNVM_SIZE                                 ((uint32_t)0x00380000U)                             /*!< main ecnvm size */
#define MAIN_ECNVM_DECNVM0_SIZE                         ((uint32_t)0x00100000U)                             /*!< main ecnvm data ecnvm0 size */
#define MAIN_ECNVM_BANK0_SIZE                           ((uint32_t)0x00200000U)                             /*!< main ecnvm bank0 size */
#define MAIN_ECNVM_DECNVM1_SIZE                         ((uint32_t)0x00080000U)                             /*!< main ecnvm data ecnvm1 size */

#elif defined(NVM_VER_1_625_AND_0)
/* GD32H77XXI/GD32H78XXI: 0MB ecnvm memory and 1.625MB CNVM */
#define CNVM_SIZE                                       ((uint32_t)0x001A0000U)                             /*!< CNVM size */

#else
/* GD32H77XXW/GD32H78XXW: 7.5MB ecnvm memory and 2MB CNVM */
#define MAIN_ECNVM_DECNVM0_BASE_ADDRESS                 ((uint32_t)0x08200000U)                             /*!< main ecnvm data ecnvm0 base address */
#define MAIN_ECNVM_BANK1_BASE_ADDRESS                   ((uint32_t)0x08500000U)                             /*!< main ecnvm bank1 base address */
#define MAIN_ECNVM_BANK0_BASE_ADDRESS                   ((uint32_t)0x08700000U)                             /*!< main ecnvm bank0 base address */
#define MAIN_ECNVM_DECNVM1_BASE_ADDRESS                 ((uint32_t)0x08900000U)                             /*!< main ecnvm data ecnvm1 base address */

#define CNVM_SIZE                                       ((uint32_t)0x00200000U)                             /*!< CNVM size */
#define MAIN_ECNVM_SIZE                                 ((uint32_t)0x00780000U)                             /*!< main ecnvm size */
#define MAIN_ECNVM_DECNVM0_SIZE                         ((uint32_t)0x00300000U)                             /*!< main ecnvm data ecnvm0 size */
#define MAIN_ECNVM_BANK1_SIZE                           ((uint32_t)0x00200000U)                             /*!< main ecnvm bank1 size */
#define MAIN_ECNVM_BANK0_SIZE                           ((uint32_t)0x00200000U)                             /*!< main ecnvm bank0 size */
#define MAIN_ECNVM_DECNVM1_SIZE                         ((uint32_t)0x00080000U)                             /*!< main ecnvm data ecnvm1 size */
#endif /* NVM_VER_XX */

