RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
#define ECNVM_PAGE_SIZE                                 ((uint32_t)0x00001000U)                             /*!< ecnvm size */
#define SECTOR_SIZE                                     ((uint32_t)0x00010000U)                             /*!< sector size */
#define DATA_INTEGRITY_ENHANCE_SIZE_UNIT                ((uint32_t)0x00010000U)                             /*!< data_integrity_enhance area granularity */
#define SCR_SIZE_UNIT                                   ((uint32_t)0x00001000U)                             /*!< secure area granularity */
#define DCRP_SIZE_UNIT                                  ((uint32_t)0x00001000U)                             /*!< DCRP area granularity */
#define REPAIR_ADDRESS_UNIT                             ((uint32_t)0x00000020U)                             /*!< repair offset address granularity */
#define BAD_BLOCK_ADDRESS_UNIT                          ((uint32_t)0x00000020U)                             /*!< bad block address granularity */

#define CNVM_TIMEOUT_COUNT                              ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of CNVM timeout */
#define ECNVM_TIMEOUT_COUNT                             ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of ecnvm timeout */
#define NVMC_TIMEOUT_COUNT                              ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of NVMC timeout */
#define OTP_TIMEOUT_COUNT                               ((uint32_t)0x00FFFFFFU)                             /*!< count to judge of OTP timeout */

#define INVLD_ADDRESS_FLAG                              ((uint8_t)0x00U)                                    /*!< the address is invalid */
#define VLD_ADDRESS_FLAG                                ((uint8_t)0x01U)                                    /*!< the address is valid */

/* OTP parameters' logical address */
#define OTP_USER_CFG_CTL0_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0000U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL0 low 16bits */
#define OTP_USER_CFG_CTL0_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0020U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL0 high 16bits */
#define OTP_USER_CFG_CTL1_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0040U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL1 low 16bits */
#define OTP_USER_CFG_CTL2_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0060U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL2 low 16bits */
#define OTP_USER_CFG_CTL2_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0080U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL2 high 16bits */
#define OTP_USER_CFG_CTL3_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF00A0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL3 low 16bits */
#define OTP_USER_CFG_CTL3_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF00C0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL3 high 16bits */
#define OTP_USER_CFG_CTL4_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF00E0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL4 low 16bits */
#define OTP_USER_CFG_CTL5_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0100U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL5 low 16bits */
#define OTP_USER_CFG_CTL5_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0120U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL5 high 16bits */
#define OTP_USER_DBGPSWD_DATA_AXI_ADDR                  ((uint32_t)0x1FFF0140U)                             /*!< AXI write access address of OTP user configuration debug password parameter */
#define OTP_AES_KEY_AXI_ADDR                            ((uint32_t)0x1FFF01C0U)                             /*!< AXI write access address of OTP user configuration aes key parameter */
#define OTP_USER_DATA_AXI_ADDR                          ((uint32_t)0x1FFF02C0U)                             /*!< AXI access address of OTP user data parameter */

/* invalid DCRP area value */
#define INVALID_DCRP_START_ADDR                         ((uint32_t)0x000000FFU)                             /*!< the start address to make DCRP area invalid */
#define INVALID_DCRP_END_ADDR                           ((uint32_t)0x00000000U)                             /*!< the end address to make DCRP area invalid */

/* invalid SCR area value */
#define INVALID_SCR_START_ADDR                          ((uint32_t)0x000000FFU)                             /*!< the start address to make SCR area invalid */
#define INVALID_SCR_END_ADDR                            ((uint32_t)0x00000000U)                             /*!< the end address to make SCR area invalid */

/* constants definitions */
/* CNVM state */
typedef enum {
    CNVM_READY = 0U,                                                                                        /*!< CNVM operation has been completed */
    CNVM_BUSY,                                                                                              /*!< CNVM operation is in progress */
    CNVM_WPERR,                                                                                             /*!< CNVM erase/program protection error */
    CNVM_PGSERR,                                                                                            /*!< CNVM program sequence error */
    CNVM_RPERR,                                                                                             /*!< CNVM read protection error */
    CNVM_RSERR,                                                                                             /*!< CNVM read secure error */
    CNVM_AUTOECCDERRDET,                                                                                    /*!< CNVM two bits detect error */
    CNVM_CRCREADY,                                                                                          /*!< CNVM CRC operation has been completed */
    CNVM_CRCBUSY,                                                                                           /*!< CNVM CRC operation is in progress */
    CNVM_CRCRERR,                                                                                           /*!< CNVM CRC read error */
    CNVM_OTAFAIL,                                                                                           /*!< CNVM OTA fail error */
    CNVM_UPDATESTRERR,                                                                                        /*!< CNVM update startup failure error */
    CNVM_REPAIR_BUSY,                                                                                       /*!< CNVM repair operation is in progress */
    CNVM_REPAIR_ECNVM_BLANK,                                                                                    /*!< CNVM ECNVM data integrity enhancement content is blank error */
    CNVM_REPAIR_READY,                                                                                      /*!< CNVM self-repair has been completed */
    CNVM_REPAIR_REPSTRERR,                                                                                  /*!< CNVM self-check repair configuration error */
    CNVM_TOERR                                                                                              /*!< CNVM timeout error */
} cnvm_state_enum;

/* ecnvm state */
typedef enum {
    ECNVM_READY = 0U,                                                                                       /*!< ecnvm operation has been completed */
    ECNVM_BUSY,                                                                                             /*!< ecnvm operation is in progress */
    ECNVM_WPERR,                                                                                            /*!< ecnvm erase/program protection error */
    ECNVM_PGSERR,                                                                                           /*!< ecnvm program sequence error */
    ECNVM_RPERR,                                                                                            /*!< ecnvm read protection error */
    ECNVM_RSERR,                                                                                            /*!< ecnvm read secure error */
    ECNVM_ECCDET,                                                                                           /*!< ecnvm two bits detect error */
    ECNVM_TOERR                                                                                             /*!< ecnvm timeout error */
} ecnvm_state_enum;

/* OTP state */
typedef enum {
    OTP_READY = 0U,                                                                                         /*!< OTP operation has been completed */
    OTP_BUSY,                                                                                               /*!< OTP operation is in progress */
    OTP_DATAERR,                                                                                            /*!< OTP Data error */
    OTP_PGLKERR,                                                                                            /*!< OTP Program at lock state error */
    OTP_MULTI_DATAERR,                                                                                      /*!< OTP Multi-redundant data error */
    OTP_PGSERR,                                                                                             /*!< OTP program sequence error */
    OTP_TOERR                                                                                               /*!< OTP timeout error */
} otp_state_enum;

/* NVMC state */
typedef enum {
    NVMC_OB_READY = 0U,                                                                                     /*!< option byte modification has been completed */
    NVMC_OB_BUSY,                                                                                           /*!< option byte modification is in progress */
    NVMC_OB_OBMERR,                                                                                         /*!< option byte modification error */
    NVMC_OB_REPSTRERR,                                                                                      /*!< option byte self-check repair configuration error */
    NVMC_OB_TOERR,                                                                                          /*!< option byte modification timeout error */
    NVMC_HSPC,                                                                                              /*!< high security protection */
    NVMC_OB_DCRP_SCR_PROT                                                                                   /*!< DCRP/SCR protection */
} nvmc_ob_state_enum;

/* ECC type */
typedef enum {
    ITCM_ECC = 0U,                                                                                          /*!< ITCM ECC */
    DTCM0_ECC,                                                                                              /*!< DTCM0 ECC */
    DTCM1_ECC,                                                                                              /*!< DTCM1 ECC */
    R2_SRAM_ECC,                                                                                            /*!< R2 SRAM ECC */
    R1_SRAM_ECC,                                                                                            /*!< R1 SRAM ECC */
    R0_SRAM_ECC,                                                                                            /*!< R0 SRAM ECC */
    CNVM_ECC                                                                                                /*!< CNVM ECC */
} ecc_type_enum;

/* NVMC area */
typedef enum {
    WP_AREA_CNVM  = 0U,                                                                                     /*!< CNVM area */
    WP_AREA_ECNVM = 1U                                                                                      /*!< main ecnvm area */
} wp_area_enum;

/* OTP parameter size enum, in byte unit */
typedef enum {
    BASE_USER_CFG_SIZE = 20U,                                                                               /*!< user configure size */
    USER_DP_SIZE       = 8U,                                                                                /*!< debug password size */
    AES_KEY_SIZE       = 16U,                                                                               /*!< AES key size */
    USER_DATA_SIZE     = 372U                                                                               /*!< user data size */
} otp_para_size;

