RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
#if defined(NVM_VER_2_AND_3_5)
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xFFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xFFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xFFFFU)

#elif defined(NVM_VER_1_625_AND_0)
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xCFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xCFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xCFFFU)
#else
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xFFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xFFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xFFFFU)
#endif /* NVM_VER_XX */

/* check bad block index */
#define NOT_NVMC_BAD_BLOCK_INDEX(index)                           ((index) > 0x3U)
/* check bad block address valid status */
#define NOT_NVMC_BAD_BLOCK_VALID(bad_block_valid)                 ((bad_block_valid) > 0x1U)

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* CNVM operation functions */
/* unlock CNVM_CTL */
void nvmc_cnvm_unlock(void);
/* lock CNVM_CTL */
void nvmc_cnvm_lock(void);
/* set the CNVM wait state counter value */
void nvmc_cnvm_wscnt_set(uint8_t wscnt);
/* empty CNVM buffer (general buffer and CPU buffer) */
void nvmc_cnvm_buf_empty(void);
/* configure ecnvm buffer */
void nvmc_ecnvm_buffer_configure(uint32_t buf_configure);
/* configure CNVM general buffer size */
void nvmc_cnvm_gp_buffer_configure(uint32_t size);
/* configure CNVM CPU buffer size */
void nvmc_cnvm_cpu_buffer_configure(uint32_t size);
/* CNVM program 32 bytes at the corresponding address */
ErrStatus nvmc_cnvm_32bytes_program(uint32_t address, uint64_t data[]);
/* CNVM erase sector */
cnvm_state_enum nvmc_cnvm_sector_erase(uint32_t address);
/* erase whole CNVM */
cnvm_state_enum nvmc_cnvm_mass_erase(void);
/* erase whole chip */
ErrStatus nvmc_typical_chip_erase(void);
/*erase whole chip, including CNVM and ecnvm*/
ErrStatus nvmc_protection_removed_chip_erase(void);
/* CRC calculate CNVM data block */
cnvm_state_enum nvmc_cnvm_crc_calculate(uint32_t *crc_value);
/* cnvm ecc mode config */
cnvm_state_enum nvmc_cnvm_ecc_mode_config(uint32_t ecc_mode);
/* enable cnvm ecc mode config lock */
cnvm_state_enum nvmc_cnvm_ecc_mode_lock(void);
/* software trigger CNVM repair */
cnvm_state_enum nvmc_cnvm_repair(void);
/* get CNVM read only bad block address after self-check */
uint8_t nvmc_cnvm_read_only_bad_block_address_get(uint32_t index, uint32_t *bad_block_address, uint32_t *error_stat);

/* CNVM interrupts and flags management functions */
/* get CNVM operation flag */
FlagStatus nvmc_cnvm_flag_get(uint32_t cnvm_flag);
/* clear CNVM pending flag */
void nvmc_cnvm_flag_clear(uint32_t cnvm_flag);
/* enable CNVM interrupt */
void nvmc_cnvm_interrupt_enable(uint32_t cnvm_int);
/* disable CNVM interrupt */
void nvmc_cnvm_interrupt_disable(uint32_t cnvm_int);
/* get CNVM operation interrupt flag */
FlagStatus nvmc_cnvm_interrupt_flag_get(uint8_t cnvm_int_flag);
/* clear CNVM operation interrupt flag */
void nvmc_cnvm_interrupt_flag_clear(uint8_t cnvm_int_flag);
/* get CNVM repair pending flag */
FlagStatus nvmc_cnvm_repair_flag_get(uint32_t cnvm_repair_flag);
/* clear CNVM repair pending flag */
void nvmc_cnvm_repair_flag_clear(uint32_t cnvm_repair_flag);
/* enable CNVM repair interrupt */
void nvmc_cnvm_repair_interrupt_enable(uint32_t cnvm_repair_int);
/* disable CNVM repair interrupt */
void nvmc_cnvm_repair_interrupt_disable(uint32_t cnvm_repair_int);
/* get CNVM repair operation interrupt flag */
FlagStatus nvmc_cnvm_repair_interrupt_flag_get(uint8_t cnvm_repair_int_flag);
/* clear CNVM repair operation interrupt flag */
void nvmc_cnvm_repair_interrupt_flag_clear(uint8_t cnvm_repair_int_flag);
/* get the number of error count fail to repair during self-check */
uint8_t nvmc_cnvm_robbcnt_get(void);
/* get the error status during self-check */
uint8_t nvmc_cnvm_repair_error_status_get(void);
/* clear the number of error count fail to repair during self-check */
void nvmc_cnvm_robbcnt_clear(void);
/* clear error status during self-check */
void nvmc_cnvm_repair_error_status_clear(void);
/* clear the result of repair during self-check, including counter, error address, and status */
void nvmc_cnvm_self_check_repair_flag_clear(void);
/* ecnvm operation functions */
/* unlock NVMC_ECNVM_CTL */
void nvmc_ecnvm_unlock(void);
/* lock NVMC_ECNVM_CTL */
void nvmc_ecnvm_lock(void);
/* ecnvm program a double-word at the corresponding address */
ecnvm_state_enum nvmc_ecnvm_doubleword_program(uint32_t address, uint64_t data);
/* ecnvm program 32 bytes at the corresponding address */
ecnvm_state_enum nvmc_ecnvm_32bytes_program(uint32_t address, uint64_t data[]);
/* ecnvm erase page */
ecnvm_state_enum nvmc_ecnvm_page_erase(uint32_t address);
/* ecnvm erase sector */
ecnvm_state_enum nvmc_ecnvm_sector_erase(uint32_t address);
/* ecnvm erase whole chip */
ecnvm_state_enum nvmc_ecnvm_mass_erase(void);

/* ecnvm interrupts and flags management functions */
/* get ecnvm operation flag */
FlagStatus nvmc_ecnvm_flag_get(uint32_t ecnvm_flag);
/* clear ecnvm pending flag */
void nvmc_ecnvm_flag_clear(uint32_t ecnvm_flag);
/* enable ecnvm interrupt */
void nvmc_ecnvm_interrupt_enable(uint32_t ecnvm_int);
/* disable ecnvm interrupt */
void nvmc_ecnvm_interrupt_disable(uint32_t ecnvm_int);
/* get ecnvm interrupt operation flag */
FlagStatus nvmc_ecnvm_interrupt_flag_get(uint8_t ecnvm_int_flag);
/* clear ecnvm interrupt pending flag */
void nvmc_ecnvm_interrupt_flag_clear(uint8_t ecnvm_int_flag);

/* OTP operation functions */
otp_state_enum nvmc_otp_halfword_program(uint32_t address, uint16_t data);
/* program all AES KEY parameter */
otp_state_enum nvmc_otp_aes_key_all_program(uint16_t buf[]);
/* program all debug password parameter */
otp_state_enum nvmc_otp_dp_all_program(uint16_t buf[]);
/* program all user data parameter */
otp_state_enum nvmc_otp_user_data_all_program(uint16_t buf[]);
/* start OTP repair */
otp_state_enum nvmc_otp_repair(void);

/* OTP interrupts and flags management functions */
/* get OTP operation flag */
FlagStatus nvmc_otp_flag_get(uint32_t otp_flag);
/* clear OTP pending flag */
void nvmc_otp_flag_clear(uint32_t otp_flag);
/* enable OTP interrupt */
void nvmc_otp_interrupt_enable(uint32_t otp_int);
/* disable OTP interrupt */
void nvmc_otp_interrupt_disable(uint32_t otp_int);
/* get OTP interrupt operation flag */
FlagStatus nvmc_otp_interrupt_flag_get(uint8_t otp_int_flag);
/* clear OTP interrupt pending flag */
void nvmc_otp_interrupt_flag_clear(uint8_t otp_int_flag);

/* NVMC option bytes operation functions */
/* unlock the option byte operation */
void nvmc_ob_unlock(void);
/* lock the option byte operation */
void nvmc_ob_lock(void);
/* send option byte change command */
nvmc_ob_state_enum nvmc_ob_start(void);
/* modified option byte to factory value */
nvmc_ob_state_enum nvmc_ob_factory_value_config(void);
/* program the option bytes OBSTAT0 */
nvmc_ob_state_enum nvmc_ob_obstat0_config(uint32_t ob_obstat0, uint32_t ob_obstat0_mask);
/* enable secure access mode */
nvmc_ob_state_enum nvmc_ob_secure_access_mode_enable(void);
/* disable secure access mode */
nvmc_ob_state_enum nvmc_ob_secure_access_mode_disable(void);
/* configure the option byte security protection */
nvmc_ob_state_enum nvmc_ob_security_protection_config(uint32_t ob_spc);
/* program low power related option byte configuration */
nvmc_ob_state_enum nvmc_ob_low_power_write(uint32_t ob_deepsleep, uint32_t ob_stdby, uint32_t ob_fwdg_suspend_deepsleep,
        uint32_t ob_fwdg_suspend_standby);
/* configure option byte BOR threshold value */
nvmc_ob_state_enum nvmc_ob_bor_threshold_config(uint32_t ob_bor_th);
/* enable hardware watchdog */
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_enable(void);
/* disable hardware watchdog */
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_disable(void);
/* enable OTA check */
nvmc_ob_state_enum nvmc_ob_ota_check_enable(void);
/* disable OTA check */
nvmc_ob_state_enum nvmc_ob_ota_check_disable(void);
/* enable firmware update */
nvmc_ob_state_enum nvmc_ob_firmware_update_enable(void);
/* disable firmware update */
nvmc_ob_state_enum nvmc_ob_firmware_update_disable(void);
/* configure option byte bank0 as data integrity enhancement area of CNVM */
nvmc_ob_state_enum nvmc_ob_ecnvm_bank0_data_integrity_enhance_cnvm(void);
/* configure option byte bank1 as data integrity enhancement area of CNVM */
nvmc_ob_state_enum nvmc_ob_ecnvm_bank1_data_integrity_enhance_cnvm(void);
/* enable ecc */
nvmc_ob_state_enum nvmc_ob_ecc_enable(uint32_t ecc_type);
/* disable ecc */
nvmc_ob_state_enum nvmc_ob_ecc_disable(uint32_t ecc_type);
/* enable cnvm ecc mode */
nvmc_ob_state_enum nvmc_ob_cnvm_ecc_enable(void);
/* enable cnvm ecc mode config */
nvmc_ob_state_enum nvmc_ob_cnvm_ecc_mode_config_enable(void);
/* enable pipeline mode */
nvmc_ob_state_enum nvmc_ob_pipemode_enable(void);
/* disable pipeline mode */
nvmc_ob_state_enum nvmc_ob_pipemode_disable(void);

/* program the option bytes OBSTAT1 */
nvmc_ob_state_enum nvmc_ob_obstat1_config(uint32_t ob_obstat1, uint32_t ob_obstat1_mask);
/* program the option bytes user data */
nvmc_ob_state_enum nvmc_ob_data_config(uint32_t user_data);
/* configure option byte ITCM size in ITCM/DTCM shared RAM */
nvmc_ob_state_enum nvmc_ob_itcm_dtcm_shared_ram_config(uint32_t itcm_size);
/* configure option byte ITCM size in ITCM/AXI shared RAM */
nvmc_ob_state_enum nvmc_ob_itcm_axi_shared_ram_config(uint32_t itcm_size);
/* configure option byte CPUBUSTO */
nvmc_ob_state_enum nvmc_ob_cpubusto_reset_value_config(uint32_t cpubusto_value);

