RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_nvmc.h
/* configure boot address */
nvmc_ob_state_enum nvmc_ob_boot_address_config(uint32_t boot_pin, uint16_t boot_address);
/* configure DCRP area */
nvmc_ob_state_enum nvmc_ob_dcrp_area_config(uint32_t dcrp_en, uint32_t dcrp_eren, uint32_t dcrp_start, uint32_t dcrp_end);
/* configure secure area */
nvmc_ob_state_enum nvmc_ob_secure_area_config(uint32_t scr_en, uint32_t scr_eren, uint32_t scr_start, uint32_t scr_end);
/* enable write protect */
nvmc_ob_state_enum nvmc_ob_write_protection_enable(wp_area_enum wp_area, uint64_t ob_wp);
/* disable write protect */
nvmc_ob_state_enum nvmc_ob_write_protection_disable(wp_area_enum wp_area, uint64_t ob_wp);

/* configure repair control */
nvmc_ob_state_enum nvmc_ob_repair_control_config(uint32_t ob_repctl, uint32_t ob_repctl_mask);
/* configure cupdate size during OTA upgrate */
nvmc_ob_state_enum nvmc_ob_update_size_config(uint32_t value);
/* configure data integrity enhance area size */
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_area_size_config(uint32_t value);
/* enable power-on reset self-check repair   */
nvmc_ob_state_enum nvmc_ob_power_on_self_check_enable(void);
/* disable power-on reset self-check repair   */
nvmc_ob_state_enum nvmc_ob_power_on_self_check_disable(void);
/* enable system reset self-check repair   */
nvmc_ob_state_enum nvmc_ob_system_reset_check_enable(void);
/* disable system reset self-check repair   */
nvmc_ob_state_enum nvmc_ob_system_reset_check_disable(void);
/* enable bad data replacement in CNVM with ecnvm content  */
nvmc_ob_state_enum nvmc_ob_cnvm_bad_data_replace_enable(void);
/* disable bad data replacement in CNVM with ecnvm content  */
nvmc_ob_state_enum nvmc_ob_cnvm_bad_data_replace_disable(void);
/* enable error repair unlock during self check */
nvmc_ob_state_enum nvmc_ob_error_repair_unlock_enable(void);
/* disable error repair unlock during self check */
nvmc_ob_state_enum nvmc_ob_error_repair_unlock_disable(void);
/* enable data integrity enhancement mode  */
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_mode_enable(void);
/* disable data integrity enhancement mode  */
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_mode_disable(void);
/* enable hardware self-check mode */
nvmc_ob_state_enum nvmc_ob_hardware_self_check_enable(void);
/* disable hardware self-check mode */
nvmc_ob_state_enum nvmc_ob_hardware_self_check_disable(void);
/* configure repair address */
nvmc_ob_state_enum nvmc_ob_repair_address_config(uint32_t repair_start, uint32_t repair_end);
/* configure bad block address */
nvmc_ob_state_enum nvmc_ob_bad_block_address_config(uint32_t index, uint32_t bad_block_valid, uint32_t bad_block_address);

/* get option byte hardware watchdog configuration */
FlagStatus nvmc_ob_hardware_watchdog_get(void);
/* get option byte OTA check configuration */
FlagStatus nvmc_ob_ota_check_get(void);
/* get option byte firmware update configuration */
FlagStatus nvmc_ob_firmware_update_get(void);
/* get option byte CNVM data integrity enhancement bank number */
uint8_t nvmc_ob_cnvm_data_integrity_enhance_bank_get(void);
/* get option byte secure mode */
FlagStatus nvmc_ob_secure_mode_get(void);
/* get option byte ecc configuration */
FlagStatus nvmc_ob_ecc_get(ecc_type_enum ecc_type);
/* get option byte security protection value */
FlagStatus nvmc_ob_security_protection_flag_get(void);
/* get option byte BOR threshold value */
uint32_t nvmc_ob_bor_threshold_get(void);

/* get option byte ITCM size in ITCM/AXI shared RAM */
uint32_t nvmc_ob_itcm_axi_shared_ram_itcm_size_get(void);
/* get option byte ITCM size in ITCM/DTCM shared RAM */
uint32_t nvmc_ob_itcm_dtcm_shared_ram_itcm_size_get(void);

/* get CNVM DCRP area configuration */
uint8_t nvmc_ob_cnvm_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr);
#ifndef NVM_VER_1_625_AND_0
/* get ecnvm bank0 DCRP area configuration */
uint8_t nvmc_ob_ecnvm_bank0_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr);
#ifndef NVM_VER_2_AND_3_5
/* get ecnvm bank1 DCRP area configuration */
uint8_t nvmc_ob_ecnvm_bank1_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr);
#endif /* NVM_VER_2_AND_3_5 */
#endif /* NVM_VER_1_625_AND_0 */
/* get CNVM secure area configuration */
uint8_t nvmc_ob_cnvm_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr,
                                     uint32_t *scr_area_end_addr);
#ifndef NVM_VER_1_625_AND_0
/* get ecnvm bank0 secure area configuration */
uint8_t nvmc_ob_ecnvm_bank0_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr, uint32_t *scr_area_end_addr);
#ifndef NVM_VER_2_AND_3_5
/* get ecnvm bank1 secure area configuration */
uint8_t nvmc_ob_ecnvm_bank1_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr, uint32_t *scr_area_end_addr);
#endif /* NVM_VER_2_AND_3_5 */
#endif /* NVM_VER_1_625_AND_0 */
/* get option byte write protection configuration */
uint64_t nvmc_ob_write_protection_get(wp_area_enum wp_area);
/* get boot area address */
void nvmc_ob_boot_address_get(uint32_t *boot_address_0, uint32_t *boot_address_1);

/* get option byte power-on reset self-check repair configuration */
FlagStatus nvmc_ob_power_on_self_check_get(void);
/* get option byte system reset self-check repair configuration */
FlagStatus nvmc_ob_system_reset_check_get(void);
/* get option byte bad data replacement in CNVM with ecnvm content */
FlagStatus nvmc_ob_cnvm_bad_data_replace_get(void);
/* get option byte error repair unlock status during self check */
FlagStatus nvmc_ob_error_repair_unlock_get(void);
/* get option byte data integrity enhancement mode */
FlagStatus nvmc_ob_data_integrity_enhance_mode_get(void);
/* get option byte data integrity enhance area size */
uint32_t nvmc_ob_data_integrity_enhance_area_size_get(void);
/* get option byte hardware self-check mode */
FlagStatus nvmc_ob_hardware_self_check_get(void);
/* get repair address */
uint8_t nvmc_ob_repair_address_get(uint32_t *repair_start_addr, uint32_t *repair_end_addr);
/* get bad block address */
uint8_t nvmc_ob_bad_block_address_get(uint32_t index, uint32_t *bad_block_address);

/* get option byte operation flag */
FlagStatus nvmc_ob_flag_get(uint32_t ob_flag);
/* clear option byte pending flag */
void nvmc_ob_flag_clear(uint32_t ob_flag);
/* enable option byte interrupt */
void nvmc_ob_interrupt_enable(void);
/* disable option byte interrupt */
void nvmc_ob_interrupt_disable(void);
/* get option byte interrupt operation flag */
FlagStatus nvmc_ob_interrupt_flag_get(uint8_t ob_int_flag);
/* clear option byte interrupt pending flag */
void nvmc_ob_interrupt_flag_clear(uint8_t ob_int_flag);

#endif /* GD32H77X_78X_NVMC_H */